{"pageProps":{"category":{"id":6,"name":"Sports","description":null,"department":{"id":6,"name":"Sports","created_at":"2022-03-15T17:27:18.427Z","updated_at":"2022-03-15T17:27:18.427Z"},"slug":"sports","published_at":"2022-03-15T17:27:18.478Z","created_at":"2022-03-15T17:27:18.481Z","updated_at":"2022-03-15T17:27:18.517Z","posts":[{"id":9,"title":"laser rangefinder","rankedList":{"ranklist":[{"title":"Vortex Optics Impact 1000 Yard Laser Rangefinder , BLACK","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41-wMpBRHJL._SL75_.jpg","Height":73,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41-wMpBRHJL._SL160_.jpg","Height":155,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41-wMpBRHJL._SL500_.jpg","Height":487,"Width":500}},"contents":["The Impact 1000 features an intuitive platform with angle compensation; perfect for bowhunters and range-day lovers. Range targets down to five yards out, with the ability to stretch out to 1,000 yards if need be.","The primary HCD mode displays an angle compensated distance that is ideal for the majority of hunters and shooters. An advanced LOS mode provides the option to calculate long distance, high angle shots with increased precision.","A scan feature gives continuous range readings to pan across a landscape or track a moving target. All modes can be set to read in yards or meters.","The diopter located on the eyepiece adjusts for differences in a user's eyes. Added 6x magnification brings targets in for a closer look and more accurate ranging.","Fully multi-coated optics enhance light transmission in low light settings. Waterproof and shockproof performance keep you in the hunt no matter what the conditions."]},{"title":"TIDEWE Hunting Rangefinder with Rechargeable Battery, 700Y Camo Laser Range Finder 6X Magnification, Distance/Angle/Speed/Scan Multi Functional Waterproof Rangefinder with Case","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51O6EZLCtCL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51O6EZLCtCL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51O6EZLCtCL._SL500_.jpg","Height":500,"Width":500}},"contents":["【INTEGRATED FUNCTIONS】TideWe rangefinder offers 6x magnification, and displays a straight-line vertical distance, horizontal distance, and speed to your target. We also have scaning function allowing you to continuously scan all factors influencing your play.","【Fast Accurate Reading】Our rangefinder is a premium product with advanced technology that accurately ranges from 3 to 1000 yards. It provides fast measurements within +/- 1 yard. Measuring speed is <0.5s, and helps you make sure you don‘t miss your targets.","【LIGHTWEITH & DURABLE】The weight is only 0.35lb, which makes it compact and portable. Our rangfinder is perfect for hunting or shooting at targets. Specs (Dimensions) are 4.12” x 2.61” x 1.50”. Made from strong and durable materials to protect from drops while hunting or hiking! It’s also weather resistant, so it’s capable of enduring the harshest hunting conditions.","【EASY TO USE】You simply point the target, push a button, and you get almost instantaneous precision range data on an easy-to-read LCD display.  Short press MODE button to select different mode. Long press Power button to scan the distance. You can Adjust the sight according to “+” and “-”on the adjust focus knob. Long press \"MODE\" button to switch “Meter” and “Yards” .","【USER FRIENDLY】Equipped with 750MAH rechargeable Li-ion battery, it can measure 20000 times after a fully charge. It is built with clear LCD display, which can help you get clear image even in low light conditions. The included lanyard makes the Rangefinder easy to keep handy. With ergonomic design, you can handle it comfortably. TideWe range finder features the popular camo pattern to help you stay completely hidden in the woods. We also provide a bag to save the rangefinder."]},{"title":"Vortex Optics Ranger 1800 Laser Rangefinder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41G9gb+mksL._SL75_.jpg","Height":65,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41G9gb+mksL._SL160_.jpg","Height":139,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41G9gb+mksL._SL500_.jpg","Height":435,"Width":500}},"contents":["The Ranger 1800 rangefinder is easy to use and features a clean, illuminated display and highly intuitive menu. The Ranger 1800 is capable of ranging up to 1,800 yards.","The primary HCD mode displays an angle compensated distance that is ideal for the majority of hunters and shooters. An advanced LOS mode provides you the option to calculate long distance, high angle shots with increased precision.","A scan feature gives continuous range readings as you pan across a landscape or track a moving target. Three brightness settings allow the display to stay visible in various light conditions.","Fully multi-coated lenses deliver optimal light transmission. Textured rubber armor provides a secure, non-slip grip. Water and fogproof performance keep the system operating in the harshest conditions.","The included neck lanyard and removable utility clip make the Ranger easy to pack and keep handy. Compatible with a tripod adapter, allowing use on a tripod or car window mount."]},{"title":"Vortex Optics Razor HD 4000 Laser Rangefinder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41VLDyRz6hL._SL75_.jpg","Height":64,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41VLDyRz6hL._SL160_.jpg","Height":137,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41VLDyRz6hL._SL500_.jpg","Height":430,"Width":500}},"contents":["The Razor HD 4000 with 7x magnification and a 25mm objective lens is the essential companion for the extreme hunter, archer and shooter. Tripod Adapter compatible allows the Razor to be used on a tripod or car window mount.","The Razor provides four target modes (Normal, first, last and extended laser range) and two range modes (had and Los). the scan feature displays continual distance readings when panning across a landscape or tracking a moving animal.","All weather capable ranging allows the unit to return a distance even in adverse weather conditions. Intuitive, easy-to-use menus feature a simple, clean illuminated display and allow for ranging in yards or meters","HD Optical System delivers exception resolution and outstanding color fidelity, sharpness, and light transmission. X plus Fully multi-coated lenses provide maximum light transmission for peak clarity and pinnacle low-light performance.","Built to handle tough situations The Razor uses Armorer coating to protect the lenses while rubber armor provides a secure, non-slip grip and durable external protection. O-ring seals ensure waterproof performance."]},{"title":"Leica Rangemaster CRF 2400-R Compact Laser Rangefinder (40546)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/415GQr+Xk3L._SL75_.jpg","Height":73,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/415GQr+Xk3L._SL160_.jpg","Height":157,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/415GQr+Xk3L._SL500_.jpg","Height":491,"Width":500}},"contents":["RED LED DISPLAY with automatic brightness control provides exceptionally clear and razor-sharp images and guarantees simple and reliable reading of the measured distance and the ballistic output values","EESY OPERATION via the new Hunting App that calculates the individual ballistic output values based on caliber, bullet type, trajectory and weigh","THE EXTREMELY FAST SCAN MODE captures the environment every 0.3 seconds and displays the values in decimal numbers for a precise, safe shot at any distance","MEASURING RANGE 10 TO 2,400 YARDS and integrated BLUETOOTH CONNECTIVITY","WATER AND DUST PROTECTION provided with AquaDura lens coating and carbon-fiber-reinforced plastic housing"]},{"title":"Gogogo Sport Vpro 1200 Yards Laser Range Finder, Green Hunting with Flagpole Lock - Ranging - Speed and Scan 6X Rangefinders with USB Cable","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41BmmaJG4EL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41BmmaJG4EL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41BmmaJG4EL._SL500_.jpg","Height":500,"Width":500}},"contents":["【Laser Rangefinder for Hunting】-- Class 1, 905nm laser type, 6X Magnification, 7-degree field angle, distance range 5-1200yds, 170+yds to Flag. Provides fast measurement with accuracy ±1m, LCD Digital display, with Pinsensor & Vibration & Slope Technology","【3 Mode & Easy to Use】-- 3 Mode to Choice: Distance Measure & Normal Scan Mode, Golf Mode and Speed Mode: Normal Scan Mode is for distance measurements when you hold down the power button, the data on the LCD screen will change as you move. The second Golf mode will show us the angle and slope-adjusted distance, real distance between golfer and flag; Last one is Speed mode, Press \"M\" Button to change measure mode","【Unique Design & Battery USB Charging】-- Our range finder for hunting with clear optics, Sizes 106x 72 x 40 mm and weight 184g, perfect for carrying while hunting or Golf, durable body, Different from others with External 3.7V 900mah rechargeable lithium battery, this one use Built-in rechargeable battery for the device","【Green Hunting Rangefinder】-- Designed for hunting and can measure both distance and speed. Provides distance data needed for accurate shots to avoid spooking your target. Give you an amazing experience of hunting.","【100% Satisfaction Promise】-- We provide a 1-year warranty, we would give you a new rangefinder or a full refund if the rangefinder has quality problems within one year"]},{"title":"Sig Sauer SOK10001 Kilo1000 Laser Range Finding Monocular, 5X20MM, HT, Black, One Size","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41dT9PU9muS._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41dT9PU9muS._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41dT9PU9muS._SL500_.jpg","Height":500,"Width":500}},"contents":["5x20 mm monocular with SpectraCoatTM anti-reflection coatings for superior light transmission and optical clarity","Revolutionary LightwaveTMDSP Technology for the fastest and longest distance rangefinder engine","HyperScan provides 4x range updates per second in scan mode while RangeLock reports the last range result when ranging distant targets","Features line of sight or angle modified range","High Transmittance LCD display for superior low-light performance","Sport type: Tactical & Military"]},{"title":"Bushnell Engage Hunting Laser Rangefinder_LE1700SBL Multi, One Size","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51wUnzi6VvL._SL75_.jpg","Height":62,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51wUnzi6VvL._SL160_.jpg","Height":133,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51wUnzi6VvL._SL500_.jpg","Height":416,"Width":500}},"contents":["2x brighter: 50% larger Objective lens paired with an all glass optical system","Arc technology: angle range compensation (Arc) accounts for terrain angle","Exo barrier","Included ACCESSORIES: Durable carrying case, Para cord, and lanyard tether"]},{"title":"Leica Rangemaster CRF 2800.COM Compact Laser Rangefinder (40506), Black","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41vP8yZHdfL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41vP8yZHdfL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41vP8yZHdfL._SL500_.jpg","Height":500,"Width":500}},"contents":["RED LED DISPLAY with automatic brightness control provides exceptionally clear and razor-sharp images and guarantees simple and reliable reading of the measured distance and the ballistic output values","EESY OPERATION via the new Hunting App that calculates the individual ballistic output values based on caliber, bullet type, trajectory and weigh","THE EXTREMELY FAST SCAN MODE captures the environment every 0.3 seconds and displays the values in decimal numbers for a precise, safe shot at any distance","MEASURING RANGE 10 TO 2,700 YARDS and integrated BLUETOOTH CONNECTIVITY","WATER AND DUST PROTECTION provided with AquaDura lens coating and carbon-fiber-reinforced plastic housing","included components: item"]},{"title":"Gogogo Sport Vpro Laser Golf/Hunting Rangefinder, 6X Magnification Clear View 650/900 Yards Laser Range Finder, Accurate, Slope Function, Pin-Seeker & Flag-Lock & Vibration, Easy-to-Use Range Finder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41BDrNKSWeL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41BDrNKSWeL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41BDrNKSWeL._SL500_.jpg","Height":500,"Width":500}},"contents":["HIGH PERFORMANCE & AFFORDABLE RANGEFINDER - Gogogo Sport focus on providing worldwide customers with great quality products but at the affordable price. Let our customers pay LESS and get MORE! The most effective rangefinder on this market., worth your every penny.","GOLF/HUNTING RANGEFINDER - Come with 3 Modes, Normally Scan Mode, this mode can be used to range measurement of all items within the scope of application(5-650 Yard). Golf Mode, this mode design for golf sports specifically, pin-seek(150 Yard),flag-lock(300 Yard), JOLT Technology, Slope Distance Correction. Speed Modes, Measuring Range of Speed: 20-300km/h, this mode is ideal for hunting or other outdoor sports.","EXCELLENT GOLF MODE - This newest GS03 Golf Rangefinder is equipped with the most advanced golf rangefinder technology. Pin-seeking and flag-lock tech let you know the exact distance to swing. And when you lock to the target, pin, flag, or anything else, the JOLT tech would vibrate to remind you, and the data will appear in front of your eyes. clearly. At least but not last, the very helpful Slope Distance Correction function, the SDC function would help you swing in the right distance.","EASY TO USE - Fast and accurate measurement with 1-yard accuracy, one-button meter and yard switching, on-button mode switching. Only 184g nets weight, and portable small mini size: 106 x 40 x 71mm(L x W x H), very convenient to carry with strap and after-use storage with a small waterproof pouch. Come with full packing: pouch, strap, clean cloth, operation manual.","100% RELIABLE AFTER-SERVICE - provides outstanding pre/after customer service, contact us if you got any questions, we will reply to you within 24 hours. As a brand seller, we’re full of confidence in our products, also we provide a one-year warranty."]},{"title":"ATN Auxiliary Ballistic Smart Laser Rangefinder w/Bluetooth, device works with Mil and MOA scopes using ATN Ballistic Calculator App , Black","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/31bWu85ub3S._SL75_.jpg","Height":66,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/31bWu85ub3S._SL160_.jpg","Height":142,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/31bWu85ub3S._SL500_.jpg","Height":445,"Width":500}},"contents":["Unmatched Accuracy - range in up to 1000 yards with the ABL 1000. One button operation through your ATN Smart scope makes ranging easier than ever","Smart Ballistic Calculator - just press one button to integrate with your Smart Scope and shift your reticle to the new POI (Point of Impact)","Pairs with Smart HD - works with ATN’s X-Sight II, X-Sight 4K, and ThOR 4 series","See the Distance to your target on your Videos - not sure how far you were when you made that perfect shot. No worries your video will have the range tag on it","> NOTE: There will be no visible indication that the device is powered ON other than the Bluetooth icon in the scope changing to a solid blue circle and the rangefinder function is responsive when used. The Proper function can be tested when the user tries to Zero the ABL. A red laser will be visible when the screw covering is removed.","> NOTE: The screw that is covering the zeroing laser has to be removed in order to zero the ABL to ensure device is centered and working properly."]},{"title":"Leupold RX-2800 TBR Laser Rangefinder Black ,7x","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41KpQaUzrKL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41KpQaUzrKL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41KpQaUzrKL._SL500_.jpg","Height":500,"Width":500}},"contents":["Great for any outdoor enthusiast","Made in the USA","Very easy to use","Sport Type: Hunting"]},{"title":"LEICA Rangemaster CRF 3500.COM Compact Laser Rangefinder (40508)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41FANhSSK8L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41FANhSSK8L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41FANhSSK8L._SL500_.jpg","Height":500,"Width":500}},"contents":["RED LED DISPLAY with automatic brightness control provides exceptionally clear and razor-sharp images and guarantees simple and reliable reading of the measured distance and the ballistic output values","EESY OPERATION via the new Hunting App that calculates the individual ballistic output values based on caliber, bullet type, trajectory and weigh","THE EXTREMELY FAST SCAN MODE captures the environment every 0.3 seconds and displays the values in decimal numbers for a precise, safe shot at any distance","MEASURING RANGE 10 TO 3,500 YARDS and integrated BLUETOOTH CONNECTIVITY","WATER AND DUST PROTECTION provided with AquaDura lens coating and carbon-fiber-reinforced plastic housing"]},{"title":"Athlon Optics Midas 1 Mile Laser Rangefinder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41192xgNG4L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41192xgNG4L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41192xgNG4L._SL500_.jpg","Height":500,"Width":500}},"contents":["Waterproof to protect the product in the harshest weather conditions or if accidentally submerged underwater","Fully Multicoated optics effectively reduces reflected light and increases the transmission of light giving you a brighter image than normal single coated lenses","Scan Mode for quick readings on different objects or tracking a moving target","effective range distance of 5-1700 yards"]},{"title":"AOFAR Hunting Range Finder HX-700N 700Yards Waterproof Archery Rangefinder for Bow Hunting with Range and Speed Mode, Angle and Horizontal Distance, Free Battery, Carrying Case","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51aHDALA3qL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51aHDALA3qL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51aHDALA3qL._SL500_.jpg","Height":500,"Width":500}},"contents":["【HIGH PRECISION FUNCTIONAL RANGEFINDER】：Advanced pinsensor technology, 6x magnification, accuracy with ±1 yard.","【HUNTING RANGE FINDER】：Measurement up to 700 yards. Use range mode can give you amazing experience for hunting even in bad weather day.","【TWO MODE FOR ANY CIRCUMSTANCE】：For hunting and golf with two mode：Range and Speed. You can easily identify target with continuous scan.","【LIGHTWEIGHT AND PORTABLE】：Dimension is 110x 75 x 45 mm and weight is 180g. Waterproof and dust resistant with durable feeling. Perfect for carrying while golfing or hunting.","【RISK FREE AND FULL ACCESSORIES】：AOFAR factory direct selling with TWO year VIP and lifetime customer support. Including carrying pouch, CR2 battery, portable rope, carabiner, cleaning cloth and user manual."]},{"title":"Astra Optix OTX1600 6x21 1760yd Laser rangefinder for Hunting, Shooting and Golfing with Red OLED Display Fast 0.10s and Accurate +/-1yd. Range Finder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41K765YnVWL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41K765YnVWL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41K765YnVWL._SL500_.jpg","Height":500,"Width":500}},"contents":["ULTRA-FAST RANGING: Our Standard Ranging Mode provides accurate and ultra-fast ranging speeds as fast as 0.10 seconds suitable for target shooting, gun hunting, bow hunting and golfing.","ACCURATE LONG RANGING CAPABILITIES: With long distance ranging capability, this rangefinder is accurate and versatile for various objects at short distance or long distances: Reflective: Up to 1760 yards, Tree: Up to 1000 yards, Deer: Up to 800 yards.","REFLECTIVE OLED DISPLAY WITH LIFETIME WARRANTY: Provides a projected red color reticle and red readout with adjustable 5 brightness settings allowing increased light transmission in low light conditions. Our products are backed by our Lifetime Fully Transferable Handshake Warranty provided by Manufacturer. No matter what, we got you back. Does not cover cosmetic damage, theft, unauthorized modification or intentional misuses/damage.","PREMIUM OPTICAL QUALITY: Our All Glass Optical System provides better light transmission vs. lesser quality plastic lens systems. 6 times magnification brings you up closer to your viewing target. Fully Multi-Coated Optical system features an optical lens system with one or more anti-reflective coatings on each air to glass lens surface to ultimately increase resolution and overall light transmission. Rain Repellent Protective Coating protects lenses from dust, debris, moisture and scratches.","ADVANCED TECHNOLOGIES: Packed with featured technologies including Scan Mode, Horizontal (Angle Corrected) Mode, Angle Mode (with LOS), Archery Mode for bow hunting, Gun Mode for target shooting and gun hunting, and Golf Mode. INCLUDED IN THE BOX: Laser Rangefinder, Premium Soft Carry Case, Microfiber Lens Cleaning Cloth, Adjustable Neck-style Lanyard, Astra Optix Decal Sticker, CR-2 Lithium Battery, and Quick Start Guide."]},{"title":"Leupold RX-1600i TBR Laser Rangefinder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/519Dz7bkdvL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/519Dz7bkdvL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/519Dz7bkdvL._SL500_.jpg","Height":500,"Width":500}},"contents":["Model #173805: RX-1600i in Black with an easy to read red OLED display, 6x magnification and accuracy within 1/2 a yard from 5 yards to 1,600 yards with selectable bow or rifle modes","True Ballistic Range with Wind (TBR-W) technology provides ballistically calculated ranges for extremely accurate shots at longer distances and steeper angles. Also provides hold point for a 10-mph crosswind out to 800 yards.","3 Selectable Reticle Options: Plus Point, Duplex, and Duplex with Plus Point","Scan Mode: continuous range updates keep you on target as you track movement or scan an area","Backed by Leupold's gold ring 2-year electronics warranty"]},{"title":"Sig Sauer KILO5K 7x25mm Ballistic Rangefinder Monocular","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41NUC2MV-8L._SL75_.jpg","Height":67,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41NUC2MV-8L._SL160_.jpg","Height":143,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41NUC2MV-8L._SL500_.jpg","Height":448,"Width":500}},"contents":["ADVANCED TECHNOLOGY; The new KILO5K 7x25 mm laser rangefinder monocular has a maximum reflective range of 5,000 yards and includes Applied Ballistics Ultralite onboard along with environmental sensors and supports BDX External (BDX-X) for connecting to external devices such as Kestrel and Garmin devices.","2 TARGET MODES: The Gen II LightWave DSP engine features new target modes: Extended Range (XR) and Fog mode along with First, Best and Last target. The rangefinder incorporates a segmented OLED display which provides range to target, elevation holdover and wind holds. All new KILO rangefinders connect with the BaseMap app to provide remote waypoints on ranged targets and can be fully configured with the SIG SAUER BDX App.","LUMATIC; The most advanced display on the market. Our OLED (Organic Light Emitting Diode) display has the largest dynamic range providing for high brightness in bright sunlight or snow conditions, yet will dim down to near nightvision levels at dusk and dawn. No other display offers this adaptive ability to prevent your pupil from constricting in low-light causing you to no longer be able to see your target.","STEALTH ID: Electro-Optics industrial design inspired by our legendary firearms; deflection armor trapezoidal surfacing breaks up the shape and visibility of the optic along with pistol slide serrations and grip checkering to add function to the form of all SIG SAUER electro-optics","SPECTRACOAT: Highly efficient, ultra-wide broadband, anti-reflection lens coatings reduce surface reflections to extremely low levels across the entire visible spectrum providing superior light transmission."]},{"title":"Bushnell Tour V5 Shift (Slope) Golf Laser Rangefinder Patriot Pack PlayBetter Bundle | with Carrying Case, Divot Tool, PlayBetter Microfiber Towel, Two Batteries | Pinseeker Jolt, 6X Mag | 201911P","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/518qR+wsicL._SL75_.jpg","Height":58,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/518qR+wsicL._SL160_.jpg","Height":125,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/518qR+wsicL._SL500_.jpg","Height":393,"Width":500}},"contents":["[BUSHNELL TOUR V5 SHIFT (SLOPE) PATRIOT PACK RANGEFINDER BUNDLE] - Bushnell Tour Shift V5 Golf Laser Rangefinder, Bushnell Golf Divot Tool, Two (2) CR2 Batteries, Bushnell Carrying Case & PlayBetter Microfiber Towel","[SLOPE TOGGLE + PINSEEKER WITH JOLT TECHNOLOGY] - Turn Slope readings on/off with the simple Slope Toggle button! Plus the Bushnell PinSeeker feature allows the Tour V5 to zero in on the target and isolate the flag. As soon as the Tour V5 is locked on the target, the rangefinder's JOLT technology shoots off short, vibrating bursts to let you know the flag has been found.","[REDEFINED CLARITY & 6X MAGNIFICATION] - With this rangefinder, not only do you get an accurate reading, but you can also get a much better view with its improved magnification, definition, and color. Objects appear up to six times closer with clear magnification.","[TOURNAMENT LEGAL & 2-YEAR WARRANTY] - The Tour V5 Shift is completely legal during tournament play with the Slope functionality is disabled AND it comes with a 2-Year Bushnell Warranty!","[PERFECT BUNDLE] - The PlayBetter Microfiber Towel will keep your Tour V5 lens clean while the extra battery will make sure you're always in action, even after long weekends of golf!"]},{"title":"Sig Sauer KILO8K-ABS 7x25 mm Laser Rangefinder Monocular with BDX 2.0, FDE, SOK8K701","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41HXordOiPL._SL75_.jpg","Height":57,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41HXordOiPL._SL160_.jpg","Height":123,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41HXordOiPL._SL500_.jpg","Height":385,"Width":500}},"contents":["ADVANCED TECHNOLOGY: Introducing the new KILO8K-ABS 7 x 25 mm rangefinding monocular with BDX 2.0. The KILO8K-ABS has a maximum reflective range of 8,000 yards and includes Applied Ballistics Elite (BDX Elite) along with onboard environmental sensors and digital compass; the KILO8K also supports BDX External (BDX-X) for connecting to external devices such as Kestrel and Garmin devices.","EFFICIENT; The Gen II LightWave DSP engine features new target modes: Extended Range (XR) and Fog mode along with First, Best and Last target. The rangefinder incorporates the first Active Matrix Organic Light Emitting Graphic Display which provides all relevant ballistic information such as range to target, elevation holdover, wind hold, energy on target and velocity at target distance.","INCREDIBLE CONNECTIONS; The all new KILO rangefinders also integrate with BaseMap to provide remote waypoints on ranged targets and can be fully configured with the Sig Sauer BDX App. All KILOs leverage Low Energy / Long Range Bluetooth 5.x for multipoint Bluetooth connections and improved connectivity to BDX enabled scopes and sights.","LUMATIC: The most advanced display on the market. Our OLED (Organic Light Emitting Diode) display has the largest dynamic range providing for high brightness in bright sunlight or snow conditions, yet will dim down to near nightvision levels at dusk and dawn. No other display offers this adaptive ability to prevent your pupil from constricting in low-light causing you to no longer be able to see your target.","STEALTH ID: Electro-Optics industrial design inspired by our legendary models; deflection armor trapezoidal surfacing breaks up the shape and visibility of the optic along with pistol slide serrations and grip checkering to add function to the form of all SIG SAUER electro-optics."]}]},"body":null,"slug":"laser-rangefinder","batch":2,"published_at":"2022-03-15T17:27:18.550Z","created_at":"2022-03-15T17:27:18.552Z","updated_at":"2022-03-15T17:27:18.587Z","SEO":null},{"id":10,"title":"laser sight","rankedList":{"ranklist":[{"title":"Tacticon BattleBeam V1 Laser Sight | Scope Rifle or Handgun | Weaver or Picatinny Rail | Red or Green Dot Lazer Sight Pistol | Tactical Sights Airsoft | | Pistol | Air Soft Optic (Green Laser)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/31WToII8zeL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/31WToII8zeL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/31WToII8zeL._SL500_.jpg","Height":500,"Width":500}},"contents":["✔ COMBAT VETERAN OWNED COMPANY! I stand by, create, and manufacture only the products that I use myself as a soldier.","✔ FAST MAGNETIC CHARGING & LIFETIME WARRANTY - We provide you with Also, if you don't like the product or if something happens to it please return it for a full refund or a new one! No questions asked!","✔ RIFLE, SHOTGUN, OR HANDGUN - This versatile laser sight can be mounted on any firearm with a picatinny or weaver rail.","✔ INCREDIBLE ACCURACY! You can adjust and zero-in this laser just like any other sight or optic. Simply use the elevation and windage wrenches included.","✔ HIGHLY VISIBLE & HIGHLY DURABLE - This laser is very powerful and can be seen with the naked eye at distances of up to 100 meters! It is made of a ultra-reinforced polymer that is both lightweight and will last a lifetime."]},{"title":"Gmconn Mini Tactical Green Laser Sights Ultra Low Profile Green Dot Laser Gun Sight for Pistols, Fit Picatinny Rail, USB Rechargeable, Lightweight (Red Laser)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/411AFviYSIL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/411AFviYSIL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/411AFviYSIL._SL500_.jpg","Height":500,"Width":500}},"contents":["✅【ONLY ONE Screw + 21MM Width Rail】There are Three alternative screw holes on the Red laser sight, choose one for your preference and use the ONLY ONE SCREW to install the sight in a perfect location on your 21MM width standard rail with screw slot. Kindly be noted: If the clear space between the screw slot of rail and the trigger guard is at least 0.9 inch, it will fit.","✅【Class IIIA, <5mW】Bright and precision Red laser sight, Safe beam intensity/wavelength: <5mW peak, 532nm, Class IIIA. Highly visible red laser in any environments which can reach up to 50 to 100ft. during the day and up to 1000 ft. at night.","✅【User Friendly】Easy ambidextrous activation for left and right-handed users. The Laser sight is made of fiber-reinforced nylon material, which offers ultra compact and lightweight with Only 1.41oz (battery included).","✅【Rechargeable Battery】The Red Laser sight for pistol is powered by a built-in rechargeable battery, which is charged with an USB-C Cable. The red beam laser can be running to 5 hours.","✅【Powerful & Precise】The low profile red laser sight compatible with standard Picatinny rail which is designed for Pistols, Handguns, Glock, PX4,SIG and etc. Adjustable windage and elevation helps you be more accurate."]},{"title":"EZshoot Red Dot Laser Sight Tactical 20mm Standard Picatinny Weaver Rail for Pistol Handgun Gun Rifle","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41eWgO244FL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41eWgO244FL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41eWgO244FL._SL500_.jpg","Height":500,"Width":500}},"contents":["High-quality Material: Exquisitely crafted with premium aluminum alloy, sturdy and durable.","Portable to take:Compact, lightweight, durable.","Fit into most Gun:The Weaver Rail of Inlook Red Dot Laser Sight is Picatinny 20mm Standard size.","Higher Accuracy:Inlook Red Dot Laser Sight Adjust to windage and elevation for day & night shooting.it is anti-vibration,fog-proof and shock-resistant.","Contact Us: If you have any problem after you receive our product, please fell free to contact us, we will resolve it."]},{"title":"Pinty Compact Tactical Red Laser Sight with Picatinny Mount Alan Wrenches for Hunting - Easy and Bright","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41g+04IU1IL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41g+04IU1IL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41g+04IU1IL._SL500_.jpg","Height":500,"Width":500}},"contents":["COMPACT FOR CLOSE QUARTERS: 32mm x 26mm x 26mm(1.2\" x 1.0\" x 1.0\") Compact but powerful in function, it’s adjustable for windage and elevation.","ALUMINUM ALLOY CONSTRUCTION: Built with ultra-solid and lightweight T6061 aluminum alloy - the same material used in aerospace and sports car chassises. Finished in matte black.","DETACHABLE PICATINNY RAIL RISER: Mount your scope or tactical flashlight atop the laser, or remove the riser mount for a sleek, low-profile setup. The 1913 rail riser easily mounts on all your different Pic rail equipped guns, from shotguns to handguns, and everything in between.","EQUIPMENT FOR ALL: We make tactical gear for everyone from weekend hunting hobbyists to hardcore concealed carriers - even airsoft and paintball players love our specialized gun accessories for the tactical advantages they provide.","LASER WAVELENGTH: 650nm, power<1mw 100m"]},{"title":"Votatu H3L-G Green Laser Sight, Aluminum Ultra Low Profile Picatinny Mount Green Dot Sight, Strobe Mode Available, Magnetic USB Rechargeable and Ambidextrous Control","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41ePDN7m4tL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41ePDN7m4tL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41ePDN7m4tL._SL500_.jpg","Height":500,"Width":500}},"contents":["Machined from high-strength aircraft aluminum and anodized with Mil-Spec finish. Stand up to recoil than most other laser gun sight.","IIIA Class Green Laser Power Output ≤5mw, features 520nm wavelength. Highly visible green laser reaches 200 meters during day and up to 2000 meters at night.","Ultra lightweight and compact. Super sleek and low profile design allows to fit in most holsters which is convenient for concealed carry.","Built-in magnetic USB rechargeable feature. Just stick the supplied USB charging cable to the charging port without any removing operation, easy and safe.","Ambidextrous control design, fits most standard, compact rail-equipped pistols,rifles and shotguns with modern (M1913 Pica tinny or Weaver-style) accessory rail."]},{"title":"UUQ Mini Laser Sight Red Dot for Weaver or Picatinny Rail | Rifle Handgun | Red Dot Lazer Sight Pistol | Tactical Sights Airsoft | Scope Hand Gun Rifles | Laser Pointer Pistol | Air Soft Optic","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41TzfqcLNPL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41TzfqcLNPL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41TzfqcLNPL._SL500_.jpg","Height":500,"Width":500}},"contents":["✔COMPACT, SMALL SIZE, LOW PROFILE.(Laser Class: IIIR ; Max. Output Power : Under 5mW)","✔HIGHER ACCURACY：Windage and elevation are adjustable.The small adjustment hole on the top is for elevation adjustment(adjust up/down). The other one on the side is for windage adjustment (right/ left).","✔HIGH QUALITY：Solid aluminum alloy construction with black matte finish.The sight laser is not only durable, but also shockproof. If something happens to it, just send the product back to get the full refund or a new replacement.","✔EASY to INSTALL ：Comes with detachable rail mount, easily and conveniently mounted.This laser sight can be mounted on any firearm with standard 20mm Picatinny or Weaver rails.","✔PACKAGE INCLUDED : 1 x Red Laser Sight; 3 x Allen Key; 3 x Batteries"]},{"title":"Flashlight Laser Sight Combo,Compact Green Laser and Light Combo,Tactical Picatinny Rail Mounted Pistol Laser with Built-in Magnetic Charging Battery,Used for Pistols,Glock,Handguns,Shotguns,Rifles","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41TUa4xfGzL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41TUa4xfGzL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41TUa4xfGzL._SL500_.jpg","Height":500,"Width":500}},"contents":["1.【Compact and Robust Construction】-This Picatinny Laser sight for handguns is in Sleek and compact design looks great with all firearms and will easily accommodate most universal holsters. Built-in laser is emitted from the flashlight, which can greatly reduce the product volume, so as to have a better concealing effect.","2.【Four Running Modes Switch & Easy Operation】- Four running modes selector switch for Laser only, LED illumination only, both Laser and LED ,LED strobe. smaller size, more easier to put into your holster without any stuck. No matter using left hand or right hand,the laser sight can be conveniently operated.Turn on both of laser flashlight combo can work up to 90 minutes or so,just laser-5 hours or so,just flashlight-2 hours or so.","3.【Convenient Magnetic & Battery Charging】-Magnetic Charging allows you to charge the pistol laser sight combo without removing from your pistol,this will save your time and you do not need to calibrate the green laser for pistol next time.New magnetic charging system for maximum convenience,powered by all common USB power sources.Magnetic charging method is time saving and money saving.","4.【Adjustable Windage and Elevation】-Fully adjustable green laser allows you to adjust for both windage and elevation. with the provided tool ,you can adjust and zero-in this laser easily. Mini sized design makes this laser sight easy to suit most of the short and long sizes of pistols and rifles, you just need to put the screw bolt to the proper slot position and tighten it will be fine.","5.【Wide Compatibility】-This picatinny laser sight combo can be mounted to pistols including Modem Semi-automatic Pistols,full size of pistols,handguns,you can also use this laser sight for rifles and shotguns with any type of 21mm width of Picatinny Weaver Accessory Rail Mount."]},{"title":"Votatu H3L-R Strobe Tactical Red Laser Sight, Aluminum Metal Construction Pistol Mount Ultra Low Profile Red Beam Laser Sight with Magnetic USB Charging, Ambidextrous Control","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41DQLFOG68L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41DQLFOG68L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41DQLFOG68L._SL500_.jpg","Height":500,"Width":500}},"contents":["Ultra lightweight and compact. Super sleek and low profile design allows to fit in most holsters which is convenient for concealed carry.","Machined from high-strength aircraft aluminum and anodized with Mil-Spec finish. Stand up to recoil than most other laser gun sight.","Strobe mode available, which can be instantly activated by simultaneously press the two switches. Ambidextrous control design. Fits most standard, compact rail-equipped pistols, rifles and shotguns with modern (M1913 Picatinny or Weaver-style) accessory rail.","Built-in magnetic USB rechargeable feature. Just stick the supplied USB charging cable to the charging port without any removing operation, easy and safe.","IIIA Class Red Laser Power Output ≤5mw, features 650nm wavelength. Highly visible blue laser reaches 50 meters during day and up to 1000 meters at night."]},{"title":"ACTIONUNION Airsoft PEQ 15 Pro Green Laser PEQ Box IR Laser + Green Laser Sight + White LED Flashlight for AEG GBB CQB (Tan)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41b+5mUUq6S._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41b+5mUUq6S._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41b+5mUUq6S._SL500_.jpg","Height":500,"Width":500}},"contents":["PEQ 15 Pro – UHP visible green laser and IR laser are adjusted easily and freely through the box body screw fixed. An upgraded version of the IR glass lenses. Upgraded electric box and CREE XML lamp bead high order 5V~7.6 constant make photometric stronger.","Tactical Switch – Easy to control. Button & Remote Control Switch works with the selector switch. Includes five types for choice: LED flashlight / IR Laser/ Green laser sight / LED Flashlight + IR Laser/ LED Flashlight + Green laser sight.","Quality and Material – 100% Brand new. Made of high strength nylon plastic. Size: 12x7.3x3.7cm. Lightweight: Only 155g. Easy to carry. The adjustable airsoft laser sight can be moved up/down/left/right. Fits for standard 20 mm Picatinny rails.","Output Power – PEQ-15 Style. <0.7-1.0 mW Class II. Flashlight: around 270 lumens; High precision green dot laser integrated with bright LED flashlight.","Battery Type - Runs with 2pcs CR123A batteries or 2pcs 16340 / RCR123A 3V or 3.7V rechargeable batteries ( BATTERIES ARE NOT INCLUDED DUE TO AIRMAIL RESTRICTED )."]},{"title":"Feyachi PL-31 Laser Sight Compact Shockproof Red Dot Laser Sight with Picatinny Rail for Pistol Handgun Shotgun Rifle","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41Cx5CqydJL._SL75_.jpg","Height":58,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41Cx5CqydJL._SL160_.jpg","Height":123,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41Cx5CqydJL._SL500_.jpg","Height":387,"Width":500}},"contents":["Machined from High-strength aircraft aluminum body is hard anodized with a Mil-Spec finish for extreme durability. Shock proof,These red laser sights stand up to recoil better than other types of laser gun sights.","IIIA Class Power Output≤5mw red laser (650nm) for maximum visibility day or night. Ambidextrous On-Off switch. Ease of use, installed within minutes with a quick detach mount","Ultra lightweight and compact 2.4\"L x 1.18W x 0.85\"H. Weight: 1.57oz (Battery included). Super sleek design fits in holsters, great for concealed carry","The Feyachi PL-31 red laser sight fits most standard, full-sized, rail-equipped pistols, rifles and shotguns with Picatinny or Weaver rails","Compact, small size, low profile with easy operate on/off press-button switch.Includes 2 sets AG13 batteries （1 extra set of batteries )."]},{"title":"Viridian C5L-R Universal Red Laser Sight and Tac Light for Sub-Compact Handgun Pistols, ECR Instant On Technology","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41S72I0q3QL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41S72I0q3QL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41S72I0q3QL._SL500_.jpg","Height":500,"Width":500}},"contents":["RED LASER: This compact red tactical laser sight utilizes a precise advanced 635nm wave length for the brightest, sharpest and visible red targeting dot. Class 3R Laser Product (Does not exceed Class IIIA emission limits), ≤ 5mW power output","RADIANCE TECHNOLOGY: 100 Lumens of bright light with horizontal light dispersion to better view threats across a wider area. Use the 140 Lumen strobe mode to disorient attackers.","EASY ACTIVATION: Easily activate the world's brightest red laser and/or the LED light when drawn. No fumbling with buttons in critical situations. When you draw, it's on!","UNIVERSAL MOUNTING SYSTEM: The modular rail set allows for quick mounting to virtually all railed handguns","BATTERY LIFE: 20+ hours in constant laser mode, 35+ hours in laser pulsing mode, or 75 minutes tac laser and light mode."]}]},"body":null,"slug":"laser-sight","batch":2,"published_at":"2022-03-15T17:27:23.230Z","created_at":"2022-03-15T17:27:23.233Z","updated_at":"2022-03-15T17:27:23.252Z","SEO":null}],"batches":[]}},"__N_SSG":true}