{"pageProps":{"post":{"id":18,"title":"mandoline slicer","rankedList":{"ranklist":[{"title":"OXO Good Grips Hand-Held Mandoline Slicer","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/31fomS-+5IL._SL75_.jpg","Height":75,"Width":26},"Medium":{"URL":"https://m.media-amazon.com/images/I/31fomS-+5IL._SL160_.jpg","Height":160,"Width":57},"Large":{"URL":"https://m.media-amazon.com/images/I/31fomS-+5IL._SL500_.jpg","Height":500,"Width":179}},"contents":["Adjustable for slices in 3 thicknesses","Window shows slices below","Slice directly onto plate, on a cutting board or hook over a bowl","Non-slip handle, knob and foot","Dishwasher safe"]},{"title":"Dash Safe Slice Mandoline Slicer, Julienne + Dicer for Vegetables, Meal Prep & More with 30+ Presets & Thickness Adjuster - Midnight Navy","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/4139YGNni5L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/4139YGNni5L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/4139YGNni5L._SL500_.jpg","Height":500,"Width":500}},"contents":["SAFER: The unique design prevents your hands from ever going near the built-in blades, making this mandoline the safest option for an expert slice.","VERSATILE: With 30+ slicing options, the mandoline cuts perfectly-even slices from 1-8mm in thickness while also offering julienne, matchstick and dicing options.","EASY CLEAN: Compact design folds down for easy storage, while the included brush eliminates buildup on the blades and food catch container keeps countertops clean.","PERFECT GIFT: The perfect wedding or new home gift, the mandoline’s small size takes up little counter or cupboard space, and is a great addition to anyone’s kitchen!","INCLUDES: Backed by a 1-year manufacturer warranty (2 yr with Feel Good Rewards Registration), the Safe Slice Mandoline comes with a food catch container, cleaning brush and recipe guide.","U.S. BASED SUPPORT: Designed in NYC, with U.S. based Customer Support on every product."]},{"title":"OXO Good Grips Chef's Mandoline Slicer 2.0","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41gYoOzuN+L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41gYoOzuN+L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41gYoOzuN+L._SL500_.jpg","Height":500,"Width":500}},"contents":["Indicator window clearly displays Thickness setting from above in inches and millimeters","Spring-loaded food holder features a wide rim to protect fingers and stores on underside of mandolin","Soft, non-slip handle provides a comfortable grip","Textured runway prevents food from sticking and parallel surfaces create even slices without wedging","Japanese stainless steel blade is angled to slice even soft foods with ease","Two-sided blade can create straight slices or crinkle/waffle cuts, plus integrated julienne and French fry blades"]},{"title":"Fullstar All-in-1 Vegetable Chopper, Mandoline Slicer & Cheese Grater | Multi Blade French Fry Cutter & Veggie Dicer | Includes Bonus Handheld Spiralizer & Kitchen Gadgets","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51RNoMRaX0L._SL75_.jpg","Height":75,"Width":66},"Medium":{"URL":"https://m.media-amazon.com/images/I/51RNoMRaX0L._SL160_.jpg","Height":160,"Width":141},"Large":{"URL":"https://m.media-amazon.com/images/I/51RNoMRaX0L._SL500_.jpg","Height":500,"Width":443}},"contents":["Greatest functionality on the market - 5 interchangeable blades means this kitchen gadget meets all of your slicing, grating and chopping needs. Choose the perfect thickness of your sliced vegetables with the easy-to-use adjuster dial and select the ideal size for your chopped vegetables by simply changing the inserts.","Bonus handheld spiralizer - compact and easy to use, the Fullstar mandoline slicer comes with a bonus 3 in 1 adjustable spiralizer. Unlike large units this kitchen gadget is easy to store and a breeze to clean as it is dishwasher-safe.","Keeping you and your family safe - we know our stainless steel blades are high quality and razor sharp. Our set therefore comes with a fingerguard and protective glove to keep you safe whilst you are using the spiral slicer and a cleaning brush and blade organizer for when you aren’t. The abs plastic is nontoxic and bpa free guaranteeing healthy meals for your family.","No mess and no slips - our catch tray makes cooking so much more convenient, no mess and no messing around! It makes cleaning effortless and our non-slip base also makes your slicing, chopping and grating that much easier. Plus the slicer chopper is entirely dishwasher-safe (top rack) .","Read the manual carefully - Please read the instruction manual provided with the Fullstar food chopper closely before use. If you have any questions or issues regarding the chopper please do not hesitate to send the seller a message through Amazon and we will respond within 24 hours"]},{"title":"Gramercy Kitchen Co. Adjustable Stainless Steel Mandoline Food Slicer - Comes with One Pair Cut-Resistant Gloves || Vegetable Onion Potato Chip French Fry Julienne Slicer","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/61YLnJcbkOL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/61YLnJcbkOL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/61YLnJcbkOL._SL500_.jpg","Height":500,"Width":500}},"contents":["WHILE OTHER MANDOLINE SLICERS CAN BE DANGEROUS AND EVEN SLICE YOUR FINGERS, ours is the ONLY mandoline that comes with what you need for safely slicing veggies. No need to touch the blades - EVER. Ours is the only slicer that comes with what YOU NEED FOR SAFELY SLICING your veggies. Cut-resistant SAFETY GLOVES. A BLADE GUARD for storage. A FOOD HOLDER for slicing. A specially-designed BRUSH for cleaning. NO WORRIES about your fingers - cut veggies safely and easily.","WHEN OTHER SLICERS BREAK, DULL, BEND OR CHIP, our blade is extremely sharp, TOP GRADE 4CR15 stainless steel unlikely to chip, dull or bend. Other slicers may tear up, make uneven cuts or destroy your veggies. With our slicer, you get a clean, even cut - NO HASSLE OR HEADACHE. The vegetable slicer body is professional quality with easy to clean surgical stainless steel. Durable black plastic accents. Will stand the test of time, becoming your favorite kitchen gadgets.","Our ADJUSTABLE BLADE dial ends fumbling for accessories and storage headaches. No hunting through your kitchen junk drawer for your favorite blade! All slicing options are built-in on our device. Slice from extremely thin to 9mm thick. Two julienne settings - 4.5mm and 9mm. NO TOUCHING BLADE to change it out. Our cutter makes quick, healthy veggie based meals, potato chips or french fries FAST AND SAFE. Unit folds flat for easy storage in a drawer.","CUSTOMER CARE PROMISE: we strive to create complete customer satisfaction, period. Our customers mean more to us than our sales. If you are unhappy with your mandoline food slicer for any reason, we will replace or refund your order. Zero questions asked. WHY WE DO WHAT WE DO: At GKC (formerly Pronto Kitchen), we love to cook. We use our products daily and we only use the best - of quality AND value for the money. We provide the exact same for our customers.","BONUSES! With your purchase you will receive a downloadable RECIPE GUIDE to get you started right away. Additionally, we are building a library of some of the best recipes around that you can use your slicer for. Free online access with your purchase. MAKE SURE TO WATCH YOUR INBOX! ALSO, please reach out - we love to help by recommending recipes and answering questions. Check out our promotional coupon - 10% off your purchase of any two items across our catalog."]},{"title":"Mandoline Slicer, Vegatable Slicer Mandoline Cutter Potato Onion Fruit with Adjustable Blades Fry Cutter Potato Chip, Kitchen Vegetable Chopper with Safety Gloves","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/513og+KI9qS._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/513og+KI9qS._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/513og+KI9qS._SL500_.jpg","Height":500,"Width":500}},"contents":["ALL-IN-ONE Mandoline Slicer: This is a Mandoline slicer with a built-in adjustable dial knob. Manually adjust the knob on the side to obtain 1-9mm slices and 4.5-9mm julienne blades. You can cut long or short, thick or thin shapes at will. Using our vegetable cutter can help you cut vegetables and fruits better.","Vegetable Slicer: A great kitchen vegetable slicer. No need to remove the blades for replacement. The mandolin slicer blades are hidden in the knob shaft and can be replaced by turning the knob, making the vegetables and fruits into slices and juliennes. It is very suitable for processing onions, carrots, cucumbers, potatoes, cabbage, squash, pumpkin, apples, lemons, etc. 5 thicknesses, as you choose.","Safe & Easy to Clean: Our vegetable slicer cutter protects your safety to the greatest extent. Equipped with a hand-held pusher can help you fix the vegetables on the slicer and push the vegetable back and forth. It can protect your hands from touching the blade. We also provide you with a pair of cut-proof gloves to protect your hand safety. The vegetable chopper slicer is easy to clean and used in the dishwasher.","High-quality Stainless Steel Blades: With ultra-sharp stainless steel blades and BPA-free ABS material, mandoline slicer provides a health guarantee for your food. The 5 ultra-sharp blades make cutting vegetables smoother. We provide blade protectors to cover sharp blades.","Humanized Design Handle: The handle bracket of the vegetable slicer adopts a humanized arc design, which is ergonomic and comfortable to hold. Brand new ABS material, safe and non-slip, foldable, easy to store."]},{"title":"Joseph Joseph Multi Hand-held Mandoline Slicer with Food Grip and Adjustable Blades Dishwasher Safe, One-size, Green","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/31aZPx7hyoL._SL75_.jpg","Height":51,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/31aZPx7hyoL._SL160_.jpg","Height":110,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/31aZPx7hyoL._SL500_.jpg","Height":346,"Width":500}},"contents":["Safely and evenly slice a variety of fruit and vegetables","Precision food grip features three styles of grip: Pinch grip for small items; Center grip for round slices; Flat grip for longer slices","Three slice thickness","Non-slip tip and easy-grip handle","Protective guard keeps fingers away from blade"]},{"title":"OXO Good Grips V-Blade Mandoline Slicer","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/31MWdt4rL1L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/31MWdt4rL1L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/31MWdt4rL1L._SL500_.jpg","Height":500,"Width":500}},"contents":["Sharp, V-shaped blade of hardened stainless steel easily slices both firm vegetables like potatoes and soft fruits like tomatoes with four easily adjustable slice thickness settings: 1.5mm, 3mm, 4.5mm and 6mm","Straight and wavy blades for straight or crinkle cuts, and julienne blades for French Fries or fine julienne strips","Food holder securely holds food and protects fingers, and textured runway keeps food from sticking","Mandoline locks closed and feet fold in for safe and compact storage","Soft handle and turning knob for comfort and non-slip feet for safety","Mandoline body and food holder are top-rack dishwasher safe (hand wash blades)","Recommended by America's Test Kitchen","Included Components: OXO Good Grips V-Blade Mandoline Slicer","Number of pieces: 4"]},{"title":"SOONEAR [Made in Japan] Mandoline Vegetable Slicer 76 Pro Grade Japanese Stainless Steel Blade Bowl Fit","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41Qeu68rzJS._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41Qeu68rzJS._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41Qeu68rzJS._SL500_.jpg","Height":500,"Width":500}},"contents":["Professional Grade Blade : Same Material as Japanese Kitchen Knives.","Side horizontal movement adjuster provides stability: Designed to solve the wobble caused by the bottom rotary adjuster.","Various types of cutting: Thickness adjustment 0.5~2.0mm x 3 types of option blade","Bowl Fit : Round edge to fit the shape of the bowl for stable specification.","Easy & speedy option blade replacement: Uniquely shaped option blade and only one knob. Easy to replace with one hand."]},{"title":"Mandoline Slicer for Food and Vegetables -VEKAYA Adjustable Kitchen Vegetable Slicer For Potatoes and Onion| French Fry Slicer, Vegetable Chopper and Cutter with Waffle Maker and Gloves (Black)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51IfpwQXsSS._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51IfpwQXsSS._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51IfpwQXsSS._SL500_.jpg","Height":500,"Width":500}},"contents":["Safe Mandoline Slicer: Many people will cut their fingers while using other mandoline slicers. But with ours, no need to touch the blade -EVER. No Touching blade to change it out. We have all the slicing options build-in the mandoline slicer. Also we have a holder and a pair of cutting resistance gloves in this mandoline slicer set to protect you from any injury. Our slicer is also LFGB standard approved blades. Our Mandolin slicer is a perfect wedding or new home gift.","Adjustable Mandoline Slicer: We designed four kinds of slicing blades for customers. One round pieces slicer, slicing from paper thin to 9mm thick. Two julienne shredders - 4.5mm and 9mm which can make WAFFLE FRIES OR RUFFLED POTATO CHIPS. And one potato slicer for french fry chips. This is everything you need in one - with 4 adjustable blades settings with easy thumb dial control.","Vegetable Chopper Saving time: With our vegetable slicer for slicing, julienne &waffle thickness settings, you will free your hand on chopping,slicing and cutting. Also with it, you get a waffle maker. With faster prep & faster cleanup you can live your best, healthiest life every day.Allows you to spend less time preparing food and enjoying more time.","Potato Slicer for Kitchen: Health shouldn’t come with a hefty price tag. Best Kitchen tools for home-working staffs. With our mandoline slicer, you save more time on cooking. You got beautiful foods and motion to the next cooking. we’re here to get you out of it! This will be your secret weapon to help you cook like a pro, even if you aren’t one.","VEKAYA Slicer After Sale Service: VEKAYA believes in making life easier, better and more enjoyable in all that we do. We strive to bring you quality products, for you to get the most out of life. We ensure we bring you nothing but the best. In the unlikely event that you don’t love your mandoline slicer set, we will give you a replacement or a full refund."]},{"title":"OXO Good Grips Large Adjustable Handheld Mandoline Slicer","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/21Rvt9cOf0L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/21Rvt9cOf0L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/21Rvt9cOf0L._SL500_.jpg","Height":500,"Width":500}},"contents":["Wide ramp accommodates a variety of vegetables from cucumbers and zucchini to cabbage and eggplant while angled sharp stainless steel blade easily slices through tough skins","Dial adjusts to 7 thicknesses in half millimeter increments","Mandoline locks in closed position for safe storage with food holder stored on board","Non-slip base keeps Mandoline stable while in use and non-slip notches allow for hooking over bowls","Clear body provides visibility while slicing","Food holder protects hands and accommodates long or round food","Wide ramp accommodates a variety of vegetables from cucumbers and zucchini to cabbage and eggplant while angled sharp stainless steel blade easily slices through tough skins","Dial adjusts to 7 thicknesses in half millimeter increments","Mandoline locks in closed position for safe storage with food holder stored on board","Non-slip base keeps Mandoline stable while in use and non-slip notches allow for hooking over bowls","Clear body provides visibility while slicing","Food holder protects hands and accommodates long or round food","The OXO Better Guarantee: If you experience an issue with your OXO product, get in touch with us for a repair or replacement. We’re grateful for the opportunity to learn from your experience, and we’ll make it better."]},{"title":"Stainless Steel Mandoline Slicer for Kitchen – 6-Setting Adjustable Mandoline Slicer, 16.5 x 5 In. Platform, Hand Guard, Cut-Resistant Gloves – Vegetable Chopper, Meat Slicer, Cheese Slicer by Medove","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51GmNxT44pL._SL75_.jpg","Height":75,"Width":72},"Medium":{"URL":"https://m.media-amazon.com/images/I/51GmNxT44pL._SL160_.jpg","Height":160,"Width":153},"Large":{"URL":"https://m.media-amazon.com/images/I/51GmNxT44pL._SL500_.jpg","Height":500,"Width":480}},"contents":["A Taste of Efficiency – Prep foods in a flash with your home kitchen mandoline slicer from Medove. A simple back-and-forth motion is all it takes to quickly cut food items with impeccable consistency.","Dial It In – Set your multipurpose food slicer to 1 of 6 thickness settings ranging from paper thin to chunky. Quickly shred through pounds of potatoes, oodles of onions, and tons of tomatoes.","Safety First – Keep your fingers away from your veggie chopper’s sharp steel blade! Pull on included cut-resistant gloves and hold foods with a blade guard. Slice safely and always watch your hands!","It Can Take the Heat – Count on your dishwasher-safe kitchen slicer to be your dependable kitchen implement for years. Your mandoline slicer is made of tough stainless steel and food-safe plastics.","Here to Help – Invite us to your kitchen and we’ll bring great tools and customer service. Your veggie, cheese, and meat slicer for home kitchens is backed by our commitment to your satisfaction."]},{"title":"Progressive International, White PL8 Mandoline Slicer","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/31sj5UHLOfL._SL75_.jpg","Height":49,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/31sj5UHLOfL._SL160_.jpg","Height":106,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/31sj5UHLOfL._SL500_.jpg","Height":333,"Width":500}},"contents":["SUPERIOR QUALITY: Strength, simplicity and safety inspired the design of our Professional Mandoline. From delicious gratins to delicate julienned carrots, our Professional Mandoline is a necessity in the kitchen","DIAL-STYLE SETTINGS: Advanced adjustable knob provides manual Settings; Slice in Paper Thin 1.0mm or Thick Cuts up to 7.5mm, With a quick turn of the wrist, you can create thick and thin waffle cuts sure to impress any guest","WIDE STAINLESS-STEEL SLICING DECK: Extra-wide, stainless steel slicing deck allows food to glide easily when secured with the safety hand guard","MULTIFUNCTIONAL: Integrated blades slice even the most delicate fruits and vegetables with precision","NON-SKID FEET FOR SAFETY: The non-skid feet on this mandoline fold in for compact storage and it is dishwasher safe for your convenience"]}]},"body":null,"slug":"mandoline-slicer","batch":{"id":2,"keywords":"lace front wig,\nlaminator,\nlandline phone,\nlap desk,\nlaptop backpack,\nlaptop cooling pad,\nlaptop,\nlaser printer,\nlaser rangefinder,\nlaser sight,\nlatex mattresse,\nlawn edger,\nlawn fertilizer,\nlawn sprinkler,\nlawn sweeper,\nmagnetic tape,\nmagnifying glasse,\nmandoline slicer,\nmandolin slicer,\nmanual food chopper,\nmargarita machine,\nmassage cushion,\nmassage oil,\nmassage table,\nmasticating juicer,\nmattresse,\nmattress pad,\ncomputer monitors,\nPortable HDD,\nlabel maker","category":null,"created_at":"2022-03-15T17:23:45.322Z","updated_at":"2022-03-15T17:23:45.322Z"},"published_at":"2022-03-15T17:28:06.274Z","created_at":"2022-03-15T17:28:06.275Z","updated_at":"2022-03-15T17:28:06.295Z","SEO":null,"categories":[{"id":10,"name":"Kitchen","description":null,"department":3,"slug":"kitchen","published_at":"2022-03-15T17:28:06.229Z","created_at":"2022-03-15T17:28:06.231Z","updated_at":"2022-03-15T17:28:06.245Z"}]}},"__N_SSG":true}