{"pageProps":{"post":{"id":22,"title":"massage cushion","rankedList":{"ranklist":[{"title":"Comfier Neck and Back Massager with Heat- Shiatsu Massage Chair Pad Portable with Compress & Rolling,Kneading Chair Massager for Full Back,Neck & Shoulder, Full Body","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51+8J6a0-jL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51+8J6a0-jL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51+8J6a0-jL._SL500_.jpg","Height":500,"Width":500}},"contents":["Full Body Massage - The portable massage chair combines Shiatsu, Kneading, Rolling, compression,Kneading,Rolling,Vibration and Heat functions to provide you a spa-like massage experience.","Shiatsu Neck & Full Back Massager -Comfier Seat Massager has 4 Shiatsu nodes for neck and shoulder massage,the shiatsu balls position can be adjusted to meet specific user. The chair massage cushion has 4 shiatsu massage nodes that cover the whole back to deliver soothe massage for back.","Optional Heat, Rolling & Spot Massage - The electric chair massager provides optional heat settings to provide soothing warmth for back. The rolling massage setting gently slides along the spine throughout the back. Spot massage allows you have a more targeted massage by focusing the 4 rolling nodes to specific body areas.","Adjustable Compression - Compress massage with 3 adjustable intensity on waist and hips, helps customize your own setting in full-coverage. Opt for a full back, upper back or lower back then combine with compress massage and heat to create a fantastic relaxing massage.","Ultimate Comfort -Strap the Comfier Shiatsu massager to your favorite chair, or put in on any sofa,couch,recliner, office chair to get the ultimate comfort seat at home or in office. Perfect fathers day gifts christmas gifts for your father,Mother,Wife,Husband,Woman or Man. For any reason, if this chair massage pad does not meet your expectations, return it for full refund within 30 days."]},{"title":"Back Massager with Heat, RENPHO Height Adjustable Shiatsu Neck and Back Massage Chair Pad, Massage Seat, S-Shape Massage Cushion for Full Back, Neck, Shoulder, Full Body","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/4138w4Ep6aL._SL75_.jpg","Height":75,"Width":45},"Medium":{"URL":"https://m.media-amazon.com/images/I/4138w4Ep6aL._SL160_.jpg","Height":160,"Width":96},"Large":{"URL":"https://m.media-amazon.com/images/I/4138w4Ep6aL._SL500_.jpg","Height":500,"Width":302}},"contents":["Full back and neck massage chair pad: The portable massage chair combines Shiatsu, Kneading, Rolling, Kneading, Vibration and Heat functions to help you completely eliminate fatigue, stress and relieve muscle pain, and provides you a spa-like massage experience.","Adjustable neck pillow and lower back massage: The back and neck massage chair features 4 unique neck massage nodes that deeply massages the neck and shoulder to relieve tired & muscle tightness. The massage pillow is vertically adjustable to fit most members of your family regardless of your heights. This back massager can massage the lowest position of the waist to relax the waist and relive lower back pain.","Ergonomic back massage design: Ergonomic design massage cushion fits your back more comfortably and has a larger massage area, which makes the massage effect more comprehensive. Massage on knots and tense muscles which brings relaxation throughout the body helps eliminate fatigue, stress, and muscle aches. It is a more portable back massager chair pad.","Shiatsu full back neck massage with heat: The shiatsu massage with optional heat function adds gentle warmth to soothe muscle discomforts. 3 Massage zones of your back for your choices: Full Back, Upper back and lower Back. The spot function allows you to concentrate the kneading nodes on specific areas for pin-point relaxation. Soothe your muscle. (Note: you may place a blanket or towel on your back to get a far softer massage when you feel the intensity is too strong.)","Versatile gift idea: High-quality leather is durable and easy to maintain. Everybody needs a daily back and neck massage. Treat yourself or your friend to a back massage of 30 minutes each day to relax the body and improve neck, shoulder, and back discomfort. (Note: not to use the products for over 30 minutes a time). Perfect gifts for mother and father."]},{"title":"Comfier Shiatsu Neck & Back Massager – 2D/3D Kneading Full Back Massager with Heat & Adjustable Compression, Massage Chair Pad for Shoulder Neck and Back Waist Hips,Full Body","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51sMmK5CEZL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51sMmK5CEZL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51sMmK5CEZL._SL500_.jpg","Height":500,"Width":500}},"contents":["Relax Full Body - The massage chair utilizes innovative 2D/3D Finger Pressure Shiatsu, Rolling, compression, Vibration and Heat functions to provide you an omni comfortable massage to the back like a spa massage.","Creative 2D/3D Shiatsu Massage - The Shiastu Neck & Back Massager with Heat, it has 4 rotation nodes to provide deep kneading massages for neck and shoulder. This massager incorporates our latest innovative technology, the massaging nodes move inward & outward motion to create 2D or 3D finger pressure shiatsu massage with double comfort for your back.","Adjustable Rolling & Spot Massage - The chair massager features soft rolling massage along the back spine combats across the whole back, and the width between two massage heads can be adjusted to fit the body. SPOT massage function allows you to concentrate massage on one area for pin-point relaxation. Also you can choose Full back, Upper back or Lower back to massage the target area as desired.","Optional Heat & Adjustable Compression Massage - The full back massager has a heating pad that delivers gentle warmth to the back. ADJUSTABLE COMPRESSION-massage on waist & hips that you can choose. Adjustable 3 intensity settings are available.","Ultimate Comfort - Place this seat massager on a sofa, couch, recliner, office chair or dinning chair to enjoy a massage in the comfort of your home ! Perfect christmas gift for mom, father, men, women, friends who need a massage. For any reason, if this massage chair pad does not meet your expectations, return it for full refund within 30 days."]},{"title":"Snailax Neck and Back Massager with Heat, Shiatsu Back Massager for Back Pain, Kneading,Rolling Massage Seat Cushion,Full Body Massage Chair Pad,Seat Massager for Chair,Ideal Gifts","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41SJIdccXhL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41SJIdccXhL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41SJIdccXhL._SL500_.jpg","Height":500,"Width":500}},"contents":["Shiatsu & Rolling Full Back Massage,Snailax massage chair pad has shiatsu rollers with rotation 4 nodes,which not only provides you with deep tissue kneading massage,also delivers gentle rolling massage along the spine to relieve tense muscle and soothe the full back pain. The width of the massage balls can be adjusted to fit the body.","Flexible neck and back massager,Snailax chair massager with 4 unique shiatsu balls on neck can be adjusted up and down to fit specific users.Suitable for people with a height between 63 and 70.9 inches (1.6m-1.8m). Spot massage on back allows you to focus the massage nodes on specific area for pin-point relaxation. Also can choose full back,upper back or lower back as you need.","Warm the body,Snailax shiatsu back massager for back pain has heating pads on neck and full back. Compared with ordinary models that only heat on shiatsu nodes, it provides real warmth to neck,shoulder and entire back,further relaxes stiff & sore muscles,eases fatigue and promotes blood circulation.","Silica gel nodes,the massage seat cushion uses innovative silica gel nodes,which are soft yet firm,providing you with a natural hand-feeling spa-like massage. The seat massager for chair has 3 vibrating massage levels to relieve tense muscles on the hip, thighs and buttocks area.","Ultimate Comfort: Snailax massage cushion can be used on sofa,couch,recliner or secured with the velcro straps to dining chair, office chair to get portable massage in the comfort of your home or office.The premium PU leather cover is durable & luxurious,easy to clean. Ideal gifts for mom,dad,men,women.Included a 30-day free return & a 24-month qulity warranty."]},{"title":"HoMedics Perfect Touch Masseuse Heated Massage Cushion | App Controlled, Adjustable Height, 4 Massage Styles | Relief for Back, Shoulder & Neck | Shiatsu, Rolling, Percussion, or Combination Massage","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41nBEXCgj7L._SL75_.jpg","Height":75,"Width":42},"Medium":{"URL":"https://m.media-amazon.com/images/I/41nBEXCgj7L._SL160_.jpg","Height":160,"Width":91},"Large":{"URL":"https://m.media-amazon.com/images/I/41nBEXCgj7L._SL500_.jpg","Height":500,"Width":285}},"contents":["4 MASSAGE STYLES: Choose from 4 different massage styles including: deep-kneading shiatsu for a deep concentration on pressure points, gentle rolling that works away aches and discomfort, invigorating percussion to aggressively work and strengthen deep-tissue muscles, or a shiatsu & percussion combination which features an alternating massage experience","CONTROL YOUR CHAIR WITH YOUR SMARTPHONE: Use your smartphone App to control the settings on your massage cushion! Create your own massage programs, or use the programmed controller, which allows you to select 3 different massage zones and spots","CUSTOMIZABLE MASSAGE SEAT: The neck and shoulder massager adjust to your height, allowing any member of the family to use this heated massager. The seat cushion massager also reverses direction, giving you the option of a traveling massage or targeted spot massage allowing you to pinpoint a specific area that needs relaxing","OPTIONAL HEAT FEATURE: This massage chair has an optional heating feature. The use of heat helps to penetrate tired muscles in your neck, back and shoulders making your massage even more soothing and relaxing","INTEGRATED STRAPPING SYSTEM: Your Perfect Touch Massage Seat has an integrated strapping system that fits most chairs snugly, while the internal cord storage system keeps the room neat when the cushion is not in use"]},{"title":"Snailax Shiatsu Massage Cushion with Heat Massage Chair Pad Kneading Back Massager for Home Office Seat use","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/411C2WEH4GL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/411C2WEH4GL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/411C2WEH4GL._SL500_.jpg","Height":500,"Width":500}},"contents":["Shiatsu Back Massager :4 deep kneading massage nodes travel up and down relaxing your entire back. 3 massage Massage Zones for your choices: Full back,Upper back,Lower back.[INTENSITY CONTROL FLAP] - The detachable intensity control flap allows you choose a softer or more intense massage.(Note: you may place a blanket or towel between you and the massager to get a far softer massage, when you still feel too strong intensity after adding the flap.","Flexible Massage Nodes: The massage nodes are adjustable at max. height of 3mm to fit the curves of the body for more comfortable massage experience. SPOT MASSAGE: Allows you to concentrate the kneading on one area for pin-point relaxation","Vibration Seat Massager: Vibration on seat with adjustable 3 levels intensity, provides you a comfortable massage to Hip and thighs.(Note: On the sitting area there is only vibration massage, no Heat)","Soothing Heat Therapy: it warms your back while relaxing tense muscles across your entire back, lumbar and shoulders.","Ultimate Comfort: Use this back massager on a sofa, couch, recliner, office chair or dinning chair to make the ultimate comfort seat in the house. The integrated strapping system secures it on chairs in place. Luxury leather with cozy smooth mesh feels comfortable to your touch.Christmas gift for dad, mom, men and women. Gift for friends."]},{"title":"Back Massager with Heat, RENPHO Chair Massage Pad, Shiatsu and Rolling Back and Neck Massager for Chair, Massage Cushion with Heat, Height Adjustable Massage Seat, for Shoulders, Full Body","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51G3WHt+lnS._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51G3WHt+lnS._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51G3WHt+lnS._SL500_.jpg","Height":500,"Width":500}},"contents":["Adjustable neck massage chair pad – Equipped with a massage pillow that fits perfectly behind your neck and vertically adjusts to fit the entire family regardless of height.","Full body back massage with heat – 8 deep kneading & shiatsu back massage nodes travel up and down to relax your entire back. Choose between a full rolling back massage, upper back massage, or lower back massage and concentrate your massage on the area for pin-point relaxation.","Soothing heat & seat vibration – Warmth applied on the neck and back helps to relax tense muscles across your entire neck, back, lumbar, and shoulders. 3 levels of adjustable intensity add an extra level of comfort to the hip and thighs during the massage. Please note: there is no heat function on the seat.","Ultimate seated comfort – Use a sofa, couch, recliner, or office chair to create the best seat in the house! The integrated strapping system fastens around the back seat of any chair.","Versatile gift idea – High-quality polyurethane leather is durable and easy to maintain. Everybody needs a daily back and neck massage. Treat yourself or your friend and improve neck, shoulder, and back discomfort with a back massage 30 minutes each day to relax the body."]},{"title":"Snailax Full Body Massage Chair Pad -Shiatsu Neck Back Massager with Heat & Compression, Kneading Full Back Massage Seat Portable Chair Massagers for Back and Neck, Shoulder","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41l+2AjPVqL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41l+2AjPVqL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41l+2AjPVqL._SL500_.jpg","Height":500,"Width":500}},"contents":["Upgrade Full Back Massager with Heat - Snailax Massage Chair Pad features 8 upgraded flexible shiatsu rollers to better fit full back and body curves, that delivers relaxing deep tissue massage for whole back. The optional infrared Heat , delivers gentle warmth which could help you relax more.","Adjustable Neck Massager - The chair massager has 4 shiatsu rotation nodes to provide deep kneading massages for neck and shoulder. The neck shiatsu balls can be adjust up & down to fit specific user. The detachable flap allows you choose a softer or more intense shiatsu massage on neck and back.","Customized SPOT Massage - Snailax neck and back massager with heat has 3 massage zones: Upper Lower and Full Back for options. The Spot massage function allowson the area selected for pin-point relaxation","Compression Massage and Vibration - The Seat massager has adjustable compression massage and vibration seat massage, the pressure support for the buttocks and lower back the vibrations to loosen you up. With 3 levels of pressure massage and 3 levels of vibration intensity, it can meet your best needs.","Premium Gift - Snailax Massage seat cushion is portable and easy to use, fasten it to office chair,dinning chair or put it on recliner,couch or sofa. A premium Mother's day Father's day gift for mom, dad, woman or men who can enjoy overall massage for daily relaxation at home or office. For any reason, you are not 100% satisfied with this massage pad,just return it for full money back within 30days."]},{"title":"Vibration Back Massager, Back Massage Cushion, 10 Vibrating Nodes to Release Stress and Fatigue, for Home and Office Use (Black)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41BYEtNBTuL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41BYEtNBTuL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41BYEtNBTuL._SL500_.jpg","Height":500,"Width":500}},"contents":["10 VIBRATING MASSAGING MOTORS - The vibrating back massage for car with 10 vibrating massaging motors and warming therapy feature, penetrate deeply into your back and thighs to help release stress, fatigue, tight muscle, improve blood circulation after getting off work or a long trip. Especially perfect for driving. (P.S. The product is NOT a shiatsu kneading massager with rolling balls)","5 MASSAGE PROGRAMS & 3 MASSAGE SPEEDS - 5 massage programs focus specific spots on upper, middle and lower back, lumbar, neck, hip and thighs, combining all these spots in a simultaneous base on your customizable selections, leaving you in a totally comfort and pressure relief.","SUITABLE FOR MANY KINDS OF PLACES - The electric car massage pad can be fitted onto all car seats, home and office chairs, flat sofa or bed. It is made from soft memory foam and quality durable fabric. After massage session is completed, fold it away in storage. It also come with a adjustable strap to make it easy to attach the massager to any seats and chair stable.","WARMING THERAPY FUNCTION - Providing soothing gentle warmth. The warming therapy is optional, you can turn it on or turn it off. With overheating protection system ensure safe use. 15 minutes shut off automatically avoid causing burden for body.","MONEY BACK GUARANTEE - You can return the back massage cushion and get your money back within 30 days."]},{"title":"Comfier Massage Seat Cushion with Heat - 10 Vibration Motors Seat Warmer, Back Massager for Chair, Massage Chair Pad for Back Ideal Gifts for Women,Men (Black)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41y4vQJ72wL._SL75_.jpg","Height":75,"Width":52},"Medium":{"URL":"https://m.media-amazon.com/images/I/41y4vQJ72wL._SL160_.jpg","Height":160,"Width":111},"Large":{"URL":"https://m.media-amazon.com/images/I/41y4vQJ72wL._SL500_.jpg","Height":500,"Width":348}},"contents":["Vibration Massage, NOT Shiatsu -The back massager with 10 vibrating motors and heat function, provides soothing gentle massage for back,thighs to help relieve stress,tension and muscle pain. It is vibrating massager only, not a shiatsu massager with roller balls.","Customizable Setting -The massage seat cushion allows you choose massaging area: Neck,Upper back,Lower back,Seat, combines all of these areas together, all-inclusive 5 programmed modes and 3 variable massage intensities to give you the best massage you can customize.","Fast Heating – The Heated seat cushion has 3 heating pads for full back and seat area, provides heat therapeutic for back and hips, thighs. It is a nice seat warmer in winter. The back heater and seat heater can work separately. 2 heat levels are available. Fast heat-up, reach 114℉at low level and 131℉ at high level.","Safe & Reliable- The seat warmer with Heat pads is equipped with overheat protection thermostat controller that is UL listed,rigorously tested for quality control and safety. Each heating pad with auto shut off feature ensures safe use. The timer is 30mins to automatically switch off.","Universal Fit -The designed universal size fits for most office chairs. It's included a home adapter for home,office use. Best gifts for Women Men. MONEY BACK GUARANTEE :For any reason, if you are not 100% satisfied with this heating pad, just return it within 30 days & get your money back."]},{"title":"SNAILAX Shiatsu Back Massager with Heat -Deep Kneading Massage Chair Pad with Adjustable Intensity, Shiatsu Chair Massager to Relax Full Body Muscle","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41y-kLRYsGL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41y-kLRYsGL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41y-kLRYsGL._SL500_.jpg","Height":500,"Width":500}},"contents":["Kneading Shiatsu massage-The Shiastu Neck & Back Massager with Heat it has 4 rotation shiatsu nodes to provide deep tissue massages for neck and shoulder and 4 shiatsu nodes massage for full back. 2 levels of shiatsu intensity for options.","Customizable Spot massage - The chair massager with customized spot massage function allows you to focus the kneading massage nodes on one area for pin-point relaxation. Also you can choose Full back, Upper back or Lower back to massage the target area as desired.","SOOTHING Heating therapy - The Shiatsu massage chair delivers soothing warmth for your body while relaxing knots tension muscles across your neck to full back and lumbar, and simultaneously improve blood circulation. Set overheating protection system for safe use.","Ultimate comfort - Use this seat massager on a sofa, couch, recliner, office chair or dinning chair to make the ultimate comfort seat in the house. The integrated strapping system secures it on chairs in place .","Great Gift Idea - This massage chair pad is a great Christmas gift for Dad, Mom, Grandpa, Grandma, Teacher, Boy friend, girl friend."]},{"title":"Snailax Shiatsu Massage Seat Cushion - 2D/3D 2-in-1 Modes Back Massager with Heat, Rolling Kneading Massage Chair Pad for Back Gifts for Women/Men/Dad/Mom","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41N4+72kRGL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41N4+72kRGL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41N4+72kRGL._SL500_.jpg","Height":500,"Width":500}},"contents":["Adjustible Shiatsu Massage Modes - This massage chair for back features 2D/3D shiatsu modes to deliver you comfort massage experience, the shiatsu massage rollers travel up and down to perform alternating deep tissue massage for full back relaxation. 2 levels of Shiatsu intensity are available for options.","Rolling Back Massage With Adjustable Width - Snailax massage chair with heat pad provides you soft rolling massage along the spine combats muscular tension and offers soothing relaxation across the full back. The width of two shiatsu balls can be adjusted. A detachable PU leather flap that provides protective padding if shiatsu massage get too intense.","Shiatsu Spot Massage - The chair massager for back with customized spot massage function allows you to focus the kneading massage nodes on one area for pin-point relaxation. You can simply use remote control to adjust spot positions for full back, upper back or lower back to massage the target points as desired.","INFRARE HEATING THERAPY - The Shiatsu back massager has optional infrared heat function that delivers gentle warmth for your full body while shiatsu nodes travels across your neck shoulder and lumbar. The heating therapy from warming rollers can help ease muscle tension, stress and promote body circulation.","Nice Gift Choice: This massage chair pad is a perfect gift for men and women! MONEY BACK GUARANTEE- If, for any reason, you are not 100% satisfied with this massage pad,just return it within 30 days and get your full money back."]},{"title":"HoMedics Total Recline Massage Cushion, Ultimate Versatility, Sit Up, Lean Back, Lie Down, Soothing Heat, Pain Relief, Deep Kneading Shiatsu Massage, Height Detection, Lumbar Stretch, Seat Vibration","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41dnGA0PzwL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41dnGA0PzwL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41dnGA0PzwL._SL500_.jpg","Height":500,"Width":500}},"contents":["#1 Brand in Massage*: The world’s most versatile massage cushion lets you enjoy a shiatsu massage whether you’re sitting up, leaning back, or lying down; use it on your chair, couch, or floor. *Source: The NPD Group. January 2020-December 2020, Retail Tracking Service.","2 Massage Styles: Relieve pain with 2 speeds of shiatsu massage; deep-kneading nodes travel up and down your entire back; loosen stiff glute muscles with 3 speeds of seat vibration massage","Revolutionary Technology: SmartScan technology detects your height (up to 6’7”) for a custom neck and shoulder massage; Air Flex technology supports and stretches your lower back to release tension","Ultimate Comfort: Soothing heat provides added comfort and deeper relaxation to enhance your massage; designed with premium cozy fabric and extra cushion for our most comfortable massage cushion yet","What’s in the Box: (1) Total Recline Shiatsu Massage Cushion, (1) Power Adapter, (1) Quick-Start Guide"]},{"title":"Back Massager with Heat & Compress,Vibrating Massage Seat Cushion for Home or Office Chair Use,Electric Body Massager Helps Relieve Stress and Fatigue for Neck,Back and Hips","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41MqM0yI2kL._SL75_.jpg","Height":75,"Width":51},"Medium":{"URL":"https://m.media-amazon.com/images/I/41MqM0yI2kL._SL160_.jpg","Height":160,"Width":110},"Large":{"URL":"https://m.media-amazon.com/images/I/41MqM0yI2kL._SL500_.jpg","Height":500,"Width":344}},"contents":["【Improved Full Back Massager】The massage chair pad is built-in multi-layer massage airbags and 2 vibration massage nodes, it uses innovative air compression technology, combines vibration and heat functions to squeeze and compress the neck, back, hip, and thigh in turns, relieves fatigue, stress, and muscle aches like a spa massage for you after long day work.Kindly Note: the remote control is packaged in the open storage bag, which is on the right side of the cushion seat.","【Customized Compression Massage & Vibration】The seat massager has adjustable compression massage intensities and areas, it feature extra vibration function at the two sides, the air pressure support for the neck,full back and buttocks to relieves your muscles allowing the vibrations to loosen you up. With 3 levels of air pressure massage and 3 massage zones to choose from, it can meet your best needs.","【Optional Heat & Safe Massager】The neck & back massager has optional heat function at waist and low back of seat part,providing sooth warmth to relieve muscle pain.It can be turned on/off separately without massage,which is equipped with overheat protection thermostat,20 minute auto shut off function ensures safe to use.","【Adjustable Neck Massager for Unisex】The back massager cushion is equipped with a flexible neck massage pillow instead of a traditional fixed neck massage node. Adjustable neck massage design to fit most people in different heights (5.2ft to 6 ft), bring a smart and better experience. Multi-layer massage airbags on the neck with enough pressure to relieve neck muscles and tension.","【Ideal Gift Plus 2 Years Warranty】Slothmore back massager be used on a sofa, couch, recliner, office chair in the house or in the car, a great gift for your family and friends at Birthday, Mothers Day,Fathers Day or Christmas Day.We provide 30 DAYS MONEY-BACK GUARANTEE for any reason and 2 YEARS WARRANTY for quality-related issues! Any problems, please feel free to contact us!"]},{"title":"HoMedics, Shiatsu XL Massage Cushion with Soothing Heat 2 Back Massage Styles, 4 Massage Nodes, 3 Massage Zones, Spot Massage, Seat Vibration, Programmed Controller, and Integrated Chair Straps","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41H7E8L9VbL._SL75_.jpg","Height":75,"Width":55},"Medium":{"URL":"https://m.media-amazon.com/images/I/41H7E8L9VbL._SL160_.jpg","Height":160,"Width":118},"Large":{"URL":"https://m.media-amazon.com/images/I/41H7E8L9VbL._SL500_.jpg","Height":500,"Width":371}},"contents":["2-IN-1: Kneading Shiatsu style for deep muscle reach and Gentle Rolling for customized massage, both in one cushion","UP AND DOWN: Extra-long massage track provides total comfort, from neck and shoulders to lower lumbar","OPTIONS GALORE: 3 back-massage zones and a programmed controller for all your relaxation decisions","HEAT THINGS UP: Enjoy soothing heat for ultimate comfort","HERE AND CHAIR: Integrated strapping system fits most chairs for easy setup"]},{"title":"Comfier Shiatsu Back Massager with Heat -Deep Tissue Kneading Massage Seat Cushion, Massage Chair Pad for Full Back, Electric Body Massager for Home or Office Chair use","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41PzsZN3NFL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41PzsZN3NFL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41PzsZN3NFL._SL500_.jpg","Height":500,"Width":500}},"contents":["Adjustable Deep Kneading Massage: The back massager features Shiatsu rollers with 4 rotating nodes that can move up and down, mimic the massage hands, perform deep tissue massage on knots and tension muscles which brings relaxation throughout the body, Helps eliminate fatigue, stress. ( 2 adjustable intensity levels for options).","Customize Zone Massage: The shiatsu back massager allows you to customize the zone and enjoy a relaxing massage as you wish. You can choose to focus the kneading massage on certain zone of your back, including Full back, Upper back and Lower Back. Also you can use SPOT massage feature to concentrate your massage on a specific area on your back for pin-point relaxation.","Soothing Heat Therapy: The Shiatsu back massage chair with heat will help to further relax your soreness and tension. The optional heating comes from heating pad that provide soothing warmth while the shiatsu balls go across your entire back, it relieves tired muscles and ease knots.","Portable Chair Massager: The integrated strapping system secures the massage chair pad to almost any of the chairs. You can place this massage device on a recliner, sofa, couch, office chair to enjoy a therapeutic massage in the comfort of your home or office. This back massage cushion will be a perfect gift for your loved ones.","Vibration Seat Massage: Vibration massage on seat with 3 adjustable intensity levels, providing a comfortable mild massage for hip and thighs. Perfect christmas gift for mom, father's day gif for father, men, friends. For any reason, if this massage chair pad does not meet your expectations, return it for full refund within 30 days."]},{"title":"Back Massager with Heat - Portable Office Massage Chair Pad, Shiatsu Kneading Massage Cushion with Adjustable Intensity for Back Pain Relief, Ideal for Home Office Car Use (Corded Massager Version)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51MKnwvmwwL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51MKnwvmwwL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51MKnwvmwwL._SL500_.jpg","Height":500,"Width":500}},"contents":["BACK PAIN RELIEF: This back massager has shiatsu roller with 14 massage nodes which make sure the massage can work all the back area. This massager is a good remedy for relief of pain.","PORTABLE AND ERGONOMIC: The back massage cushion is designed with portable and ergonomic concept; Lightweight and compact; it's easy to move from one chair or room to another. You can enjoy a relaxing deep tissue massage at home,office and car.","HEATING THERAPY: The shiatsu balls in the massage chair pad use infrared heat to improve blood circulation and relieve back muscle soreness. You may choose to turn on /off heating with a single click.","VERSATILE USE: The massage cushion could fit different usage scenarios. It allows you choose massaging area on back, leg, calf, belly etc.","PERFECT GIFT FOR LOVED ONES: This is ideal gifts for women/men, mom or dad to enjoy a deep tissue massage at home,office or in car. Buy the massager with worry-free. We offer you 1-year quality assurance and 30 days full refund or replacement."]},{"title":"SNAILAX Memory Foam Massage Mat with Heat, 6 Therapy Heating pad,10 Vibration Motors Massage Mattress Pad, Full Body Massager Cushion Relieve Neck, Back, Waist, Legs","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41FdXhlmXvL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41FdXhlmXvL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41FdXhlmXvL._SL500_.jpg","Height":500,"Width":500}},"contents":["Note - This is NOT a shiatsu kneading massager with roller balls, this is a vibration massager only. DON’T BUY, if you are looking for a shiatsu massager.","Memory Foam Padding – The massage mat is designed with soft and comfortable polyurethane memory foam as padding, the high density memory foam provides you with superior comfort and great pressure relief. FLEXIBLE and FOLDABLE - the massage cushion with flexible and foldable design work fine on the bed, couch, recliner, chair and floor, and can be folded easily for transport and storage.","Vibration Massage – 10 invigorating vibrating Massage motors provides soothing vibrating massage full body to help relief stress, tension and eliminate fatigue.(the Massage mattress pad with 5 Massage Modes,4 selective massage zones,3 Intensities to achieve the best suited for your needs.)Note: This is not a Shiatsu kneading massager with rolling balls; this is a vibration massager only.","SOOTHING HEAT – The massage mat with optional heat for full body, 6 heating pads target heat zones in the neck, upper and lower back, lumbar, thighs, and legs, to sooth and loosen tense muscles and improve body circulation. (The heat can be turned on without massage, the neck heating and body heating are working separately.) Equipped with Overheat Protection Device remains the stable temperature. the heating pad with auto shut off function is safe to use.","Soft Plush Fabric – Memory Foam Pillow comfort and soft. 100% ultra-plush, incomparably soft polyester that is creating a comfortable , great hand feeling surface for user to lie on. This massager is a perfect Thanksgiving, Christmas gift for your wife,husband,Mom,Father,friend, etc loved ones."]},{"title":"Shiatsu Back Massager with Heat, Deep Kneading Massagers for Neck and Back,Adjustable Height Massage Chair Pad, Full Body Massage Cushion for Home,Office,Gifts for Women,Men","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41l4EybnmiL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41l4EybnmiL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41l4EybnmiL._SL500_.jpg","Height":500,"Width":500}},"contents":["Adjustable Neck Massage:COMFIER massage chair has a unique flexible Shiatsu neck massager pillow with Heat, which can be adjusted vertically to suit the entire family regardless of height.","Full Back Massage:COMFIER Back Massager Chair features upgraded flexible shiatsu rollers with 8 nodes can go up/down to fit the entire back and body curves, providing a relaxing deep tissue massage for the full back. Optional infrared heat therapy can further relax muscle stiffness and back tension, and improve blood flow.You can choose full back,upper back and lower Back massage zone.","Spot Massage :The chair massager for back with customized spot massage function allows you to focus the kneading massage nodes on one area for pin-point relaxation. You can simply use remote control to adjust spot positions for full back, upper back or lower back to massage the target points as desired.","Adjustable intensity:The neck and Back Massager with 2 levels adjustable intensity, delivers you comfort massage experience . The shiatsu massage rollers travel up and down to perform alternating deep tissue massage for full back relaxation and meet your best massage need. The massage chair has 2 vibration intensity settings to relax buttocks and thighs.","Ultimate comfort :The massage seat cushion is characterized by high-quality PU leather design, which makes it easy to clean. It can be used on a sofa, recliner or chair in your home or office. Ideal gift for for family, lover, friends, and office. For any reason, If this full body massager can’t meet your expectations, return it for full money back within 30 days."]},{"title":"Medcursor Shiatsu Back Massager with Heat, Height Adjustable Massage Chair Pad, Seat Cushion Massagers for Neck and Shoulder, 2D/3D Rolling Kneading, Vibration Massage Seat, Home, Office Use","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41qxfDwA9VL._SL75_.jpg","Height":75,"Width":49},"Medium":{"URL":"https://m.media-amazon.com/images/I/41qxfDwA9VL._SL160_.jpg","Height":160,"Width":105},"Large":{"URL":"https://m.media-amazon.com/images/I/41qxfDwA9VL._SL500_.jpg","Height":500,"Width":329}},"contents":["IDEAL NECK & BACK MASSAGER: Medcurosr massage seat cushion features shiatsu, kneading, rolling, heating and vibration functions, provide you fatigue relief of neck, shoulder and back muscles and relaxations of the whole body. This chair massager will be an indispensable part of your daily wellness routine—no matter your age, health or lifestyle.","ADJUSTABLE NECK MASSAGER: Equipped with a flexible massage pillow with heat, this massager chair can be adjusted to move up and down for most heights to receive an enjoyable neck and shoulder massage. The removable neck cover acts as a buffer to lessen the intensity for a more gentle massage.","CUSTOMIZED FULL BACK MASSAGE: This Shiatsu neck and back massager features 3D kneading nodes to deliver you comfort massage like a professional’s hands. The shiatsu massage rollers can travel up and down to perform alternating deep tissue massage for full back, upper back or lower back relaxation. You can also simply use the remote control to focus on one area for pin-point relaxation. 2 levels of shiatsu intensity are available.","SOOTHING HEAT THERAPY & SEAT VIBRATION: The massage nodes feature an optional heat function on the entire back, lumbar and shoulders, bringing extra soothing throughout the body (cannot be used independently). The heating therapy helps soothe aching muscles and promote proper circulation. The seat cushion has 2 vibrating levels to soothe tired, tense muscles on the thigh area.","GREAT GIFT CHOICE: Most of us have varying degrees of shoulder, neck, and back issues. This massager is a perfect gift for friends and the family on Christmas and also on Fathers Day or Mothers Day. You may create the most comfortable seat in the home by placing this massage cushion on a sofa, couch, recliner, office chair, or dining chair."]},{"title":"FIVE S FS8816 Massage Seat Cushion, Massager with Heat, 10 Massage Nodes for Neck, Shoulders, Back/Lumbar, Thighs for Home, Office (Black)","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41aUNDMu5LL._SL75_.jpg","Height":72,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41aUNDMu5LL._SL160_.jpg","Height":155,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41aUNDMu5LL._SL500_.jpg","Height":485,"Width":500}},"contents":["Note: This is not a Shiatsu kneading massager. This is a vibration massager only, no rolling balls. Do not buy this item if you are looking for a Shiatsu massager with rolling balls.","FIVE S FS8816 invigorating massage seat cushion with 10 vibration motors for neck, shoulders, back and thighs. Soothing heat target the upper, mid and lower back areas. The combination of vibration massage and heat therapy will help increase blood circulation and relieve muscle pain, tension and stress. Built-in overheat protection. Automatic shut off in 30 minutes.","3 massage speeds or intensities, 4 massage programs, independent heat on/off control. 4 zones: Each of these zones can be selected by pressing the corresponding button for a concentrated massage on any one zone or any combination of two, three, or all four zones. A lot of variations for you to choose the massage you enjoy.","Soft plush fabric, well padded cushion. 4 adjustable elastic straps go around back of chair seat to keep cushion fastened and secure.","Perfect gift idea. For home and office. AC adapter (110-220v AC) included. High quality. UL certified. Warranty - 3 years. Return - 30 days. Satisfaction guaranteed. FIVE S FS8816 Massage Cushion with Heat is just what you need to relax and enjoy a massage while working, watching TV or sleeping. Note: car adpater is not included."]},{"title":"Snailax Back Massager with Heat,Shiatsu Massage Seat Cushion,8 Flexible Nodes Massage for Full Back Massage Chair Pad,Chair Massager for Office,Home Use","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/412AMzBCD3L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/412AMzBCD3L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/412AMzBCD3L._SL500_.jpg","Height":500,"Width":500}},"contents":["Flexible Shiatsu Massage -The shiatsu back massager with heat has 8 flexible rotation nodes to better fit back curves and provide more comforts with deep tissue massage for lower back and shoulder. The massage seat cushion helps relieve sore muscles and back, promote muscle repair and body circulation.","Full Back Spot massage - The chair massager with customized spot massage can keep kneading massage nodes in specific area and 8 nodes can travel up and down relaxing entire back. Select Full back, Upper back or Lower back to alleviate muscle soreness. Especially lower back massage can reach lower lumbar area.","Optional Heating Therapy - Activate heat on shiatsu massage nodes to relax and warm your full back on a sofa, couch, recliner, office chair or dinning chair. The detachable flap allows you to enjoy gentle or stronger full back massage. Heating therapy of seat massager soothe tired muscles and enhance comforts.","Vibration Massage on Seat: The massage cushion provides vibration massage with 3 optional intensity levels to relieve hips, thighs and release stress aches tension. The neck pillow can be removed and the integrated strapping system anti-slip silicone grip secures the massage pad on chairs in place.","Ideal Gift, High quality PU leather and breathable mesh make back massage seat for durable, easy to clean and maintain.It is ideal fathers day gift for men,gifts for Dad,gifts for women to relieve neck,shoulder back. If you’re not satisfied, return it within 30days for full money back."]},{"title":"SNAILAX Vibration Massage Seat Cushion with Heat 6 Vibrating Motors and 2 Heat Levels, Back Massager, Massage Chair Pad for Home Office use","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41DCOlIzoqL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41DCOlIzoqL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41DCOlIzoqL._SL500_.jpg","Height":500,"Width":500}},"contents":["Note: This is only a VIBRATION massager, not a Shiatsu Kneading massager. Do not buy this massage cushion if you are looking for a shiatsu massager with rolling balls.","Recise Spot Vibration Massage - This massage cushion with 6 powerful vibrating massage motors target upper back, mid back, lower back, and thighs to help relax muscle tension, stress.You can even select all 4 zones at once or individually to your liking. 5 programme modes and 4 variable vibration intensities brings you a customizable best massage as desired.","Soothing Heat Thearpy - Seat warmer with auto shut off target full back and seat, to radiating gentle warmth, to relax soreness muscles and improve body circulation. The seat massager is equipped with Overheating protection system and Auto shut off timer, dual-insurance for safe use.","Soft Plush Fabric - This massage chair pad cover is made of 100% ultra cozy plush, incomparably soft polyester that offers a comfortable and great feeling for body touch. Non-Slip rubber bottom, STAYS IN PLACE: Dual adjustable strap goes around back chair seat to keep cushion stable and secure.","Home adapter included, it is easy for you to use the cushion at home, in the office ! This seat massager will be nice Christmas gifts for woman,man"]},{"title":"Snailax Memory Foam Massage Seat Cushion - Back Massager with Heat,6 Vibration Massage Nodes & 2 Heat Levels, Massage Chair Pad for Home Office Chair","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41+fq5nGOaL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41+fq5nGOaL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41+fq5nGOaL._SL500_.jpg","Height":500,"Width":500}},"contents":["Note:This is NOT a shiatsu kneading massager with roller balls, this is a vibration massager only. DON’T BUY, if you are looking for a shiatsu massager. MEMORY FOAM PADDING – The massage seat cushion is designed with soft and comfortable polyurethane memory foam as padding, the high density memory foam provides you with superior comfort.","Vibration Massage -The back massager seat cushion has 6 invigorating massage motors that delivers vibrating massage to your tissue and muscles to help relieve muscle soreness, tension, stress and eliminate fatigue after day work or a long trip.","Customizable Massage -The Massage cushion allows you choose massaging area on Upper back, Lower back,Hips or Thighs, combining all these areas in a simultaneous, all-inclusive 5 programme modes and 4 variable vibration intensities brings you a customizable best massage as desired.","Heat Thearpy- The Seat Massager with optional heat, has 2 heat levels target full back and hips, thighs, that radiating gentle warmth to sooth tight,soreness muscles and promote body circulation. It provides you with a nice heated seat cushion that provides a seat warmer in cold weather. (The heat can be turned on without massage, the seat massager with auto shut off and overheat protection features to ensure safe use.)","Ultra Soft Plush Fabric - This massage chair pad as Christmas gift, its cover is made of 100% ultra cozy plush,incomparably soft polyester that offers a comfortable and great feeling for body touch. NON-SLIP BOTTOM & ELASTIC STRAPS -This seat massager be designed with non-slip rubber bottom and adjustable dual straps to secure it to home or office chair and keep it in place."]}]},"body":null,"slug":"massage-cushion","batch":{"id":2,"keywords":"lace front wig,\nlaminator,\nlandline phone,\nlap desk,\nlaptop backpack,\nlaptop cooling pad,\nlaptop,\nlaser printer,\nlaser rangefinder,\nlaser sight,\nlatex mattresse,\nlawn edger,\nlawn fertilizer,\nlawn sprinkler,\nlawn sweeper,\nmagnetic tape,\nmagnifying glasse,\nmandoline slicer,\nmandolin slicer,\nmanual food chopper,\nmargarita machine,\nmassage cushion,\nmassage oil,\nmassage table,\nmasticating juicer,\nmattresse,\nmattress pad,\ncomputer monitors,\nPortable HDD,\nlabel maker","category":null,"created_at":"2022-03-15T17:23:45.322Z","updated_at":"2022-03-15T17:23:45.322Z"},"published_at":"2022-03-15T17:28:34.561Z","created_at":"2022-03-15T17:28:34.563Z","updated_at":"2022-03-15T17:28:34.583Z","SEO":null,"categories":[{"id":11,"name":"Drugstore","description":null,"department":8,"slug":"drugstore","published_at":"2022-03-15T17:28:34.518Z","created_at":"2022-03-15T17:28:34.519Z","updated_at":"2022-03-15T17:28:34.535Z"}]}},"__N_SSG":true}