{"pageProps":{"post":{"id":11,"title":"latex mattresse","rankedList":{"ranklist":[{"title":"Zinus 12 Inch Green Tea Memory Foam Mattress / CertiPUR-US Certified / Bed-in-a-Box / Pressure Relieving, Queen","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51tBWhJnUFL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51tBWhJnUFL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51tBWhJnUFL._SL500_.jpg","Height":500,"Width":500}},"contents":["THE RIGHT COMBINATION - Our special recipe for rejuvenating rest. Refreshing green tea and moisture-absorbing ActivCharcoal infused into pressure-relieving memory foam that cradles your shape so you awake free of aches and pains and fresh as a daisy","PRESSURE-RELIEVING FOAMS - 3 inches conforming memory foam, 2 inches soft, airflow enhancing comfort foam, and 7 inches durable, high density base support foam; ideal for side sleepers and petite to average weight sleepers","CERTIPUR US CERTIFIED - Highest quality foam is CertiPUR US Certified for durability, performance, and content","EXPERTLY PACKAGED - Our technology allows this mattress to be efficiently compressed into one box that’s easily shipped and maneuvered into the bedroom; simply unbox, unroll and this mattress does the rest, expanding to its original shape within 72 hours","Worry-free 10 year limited warranty included; twin mattress supports a maximum weight of 250 lbs, while all other sizes can support up to 500 lbs"]},{"title":"LUCID 5 Inch Memory Foam Low Profile-Cooling Gel Infusion-Hypoallergenic Bamboo Charcoal-Breathable Cover Bed Mattress Conventional, Twin, White,2020 model","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41FEe3VXY2L._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41FEe3VXY2L._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41FEe3VXY2L._SL500_.jpg","Height":500,"Width":500}},"contents":["Help your child make the transition from crib to bed with this memory foam mattress sized for kids","Make setting up your mattress a fun memory by inviting your child to help unbox and watch as the memory foam magically decompresses","The 1-inch ventilated gel memory foam top layer creates a cooler sleep experience than traditional memory foam by helping regulate body temperature and increase circulation","4-inches of dense bamboo charcoal infused support foam provide stability and full body support to your child","We only use CertiPUR-US certified memory foam to ensure your uncompromising safety and comfort"]},{"title":"Nectar Queen Mattress 12 Inch - Medium Firm Gel Memory Foam Mattress - 365 Night Trial - 5 Layers of Comfort - Breathable Cooling Action - CertiPUR-US Certified Foams - Forever Warranty","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41m+6kwTzAL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41m+6kwTzAL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41m+6kwTzAL._SL500_.jpg","Height":500,"Width":500}},"contents":["365-NIGHT HOME TRIAL - One of the best parts of choosing a Nectar Mattress is the incredible year-long trial period that starts the day your mattress is delivered to your door.","GEL MEMORY FOAM. Nectar is a gel memory foam bed-in-a-box mattress designed for every kind of sleeper and helps distribute your weight and body heat around the mattress, so you don't sleep hot or feel lumps.","FIVE LAYERS OF COMFORT. Soft & airy top layer of quilted cooling tencel mattress cover. Second layer of gel memory foam to distribute your weight. Add in an adaptive response transition layer that provides support to avoid the feeling of sinking into quicksand. Backed with a base layer to reinforce support. At the very bottom is a mattress cover to ensure that mattress slippage is not an issue!","IDEAL SUPPORT FOR ANY POSITION. Optimal level of firmness, coolness, breathability, and comfort. Nectar molds to your body, relieving all your aches and pains. It is firm enough to support you, but soft enough to be gentle where you're sensitive. Even on those 90° nights, Nectar sleeps cool, gently regulating heat for an ideal temperature all night long.","NECTAR FOREVER WARRANTY. We guarantee Nectar for as long as you own the mattress. Longest warranty in the business (we checked).","After unroll the matters, Please allow 24 hours at room temperature for the surface to return to its normal feel."]},{"title":"Drive Medical Quick'n Easy Comfort Mattress","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/21ZxMFsh+vL._SL75_.jpg","Height":50,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/21ZxMFsh+vL._SL160_.jpg","Height":107,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/21ZxMFsh+vL._SL500_.jpg","Height":335,"Width":500}},"contents":["Foam Mattress: Active mattress replacement system provides comfort and support with its decompressing properties","Convenient Design: The system has a non-slip bottom and 4 corner straps to keep this home bedding secure; two side carry handles make lifting and placement easy","Durable Material: Removable Nylon stretch cover is fluid resistant, low shear and vapor permeable, helping protect the skin from friction and moisture","Specifications: 80 inches in length x 36 inches in width x 8 inches in height; weight capacity: 275 lbs","One Year Warranty: Buy with confidence from Drive Medical"]},{"title":"Signature Design by Ashley Chime 12 Inch Medium Firm Memory Foam Mattress, CertiPUR-US Certified, King","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51TH11u8NdL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51TH11u8NdL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51TH11u8NdL._SL500_.jpg","Height":500,"Width":500}},"contents":["KING SIZE BED IN A BOX. For deep sleep you've always dreamed of, this body contouring memory foam mattress delivers; 12 inch mattress comes compressed and rolled in a box for your convenience","SLEEP SOUNDLY. Designed with layers of memory foam for firm support and pressure relief. The support foam core reduces motion transfer for peaceful, undisturbed sleep","LOW MAINTENANCE: Made of safe material to keep out pollen and pet dander—perfect for kids or adults who suffer from allergies","KING SIZE: Measures 75\" W x 79\" D x 12\" H and is compatible with most king bed frames","READY FOR INSTANT ENJOYMENT: Arrives in a box. Simply unbox, cut the protective wrap, unroll and watch the mattress expand. Mattress is safe to sleep on immediately but can take 72+ hours for any risidual scent from packaging to dissipate and for mattress to completely expand based on ambient room temperature, humidity, air pressure & ventilation.","DIRECT FROM THE MANUFACTURER: Ashley Furniture goes the extra mile to package, protect and deliver your purchase in a timely manner","BUY WITH CONFIDENCE: Designed and manufactured by Ashley Furniture Industries. The trusted source for stylish furniture, lighting, rugs, accessories and mattresses. For every taste and budget"]},{"title":"Sleep Innovations Marley Cooling Gel Memory Foam Mattress, 10 Inches, Queen","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51tOusTFw3S._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51tOusTFw3S._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51tOusTFw3S._SL500_.jpg","Height":500,"Width":500}},"contents":["Queen Size Cooling Memory Foam Mattress: This 10 inch cooling gel memory foam mattress is perfect for hot sleepers; The gel memory foam top layer and supportive center combine to relieve pressure","Cooling Comfort: Available in medium and medium firm options, the Marley mattress features a triple layer design with airflow channels in the supportive middle layer to maintain a comfortable climate all night","Support For Every Sleeper: Whether you are a side sleeper or feel best on your stomach or back, looking for motion isolation, edge support, and/or breathability, we have an eco conscious mattress for you","Quality First: The Marley mattress is made in the USA and Mexico. Our memory foam mattresses, mattress toppers, and pillows are all hypoallergenic and CertiPUR-US certified, offering you high quality materials for high quality sleep","Committed To Great Sleep: We invented the memory foam mattress in a box and we continue to innovate restorative foams and fabrics to give you the best night's sleep; This mattress comes with a 10 year warranty"]},{"title":"Casper Sleep Element Mattress, Queen","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41kTypSt-UL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41kTypSt-UL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41kTypSt-UL._SL500_.jpg","Height":500,"Width":500}},"contents":["Balance: The Element is engineered to combine both softness and support. The top layer of memory foam comforms to your body to relieve pressure.","AirScapeTM: A layer of AirScapeTM perforated breathable foam increases airflow and circulates air so you don't get too hot at night. The tiny holes move hot air and body heat away.","Support: The durable base foam is engineered to prevent sinking and sagging while supporting your whole body.","Certified by our Sleep Lab","100 night trial and free returns within 100 days of receipt of shipment on products sold by Casper","Kindly allow 72 hours for the product to inflate competely."]},{"title":"LUCID 12 Inch Latex Hybrid Mattress - Memory Foam - Responsive Latex - Steel Coils - Firm Feel - Temperature Neutral","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51Htv7NQXjS._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51Htv7NQXjS._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51Htv7NQXjS._SL500_.jpg","Height":500,"Width":500}},"contents":["6.5-inch, high-quality steel coils are individually-wrapped to increase airflow, isolate motion, and conform to individual sleep styles","Plush memory foam layer is topped with natural latex for the perfect combination of sink and spring","Perfect mattress for those who want the comfort of memory foam with the hypoallergenic and breathable properties of latex","Attractive, two-tone cover finishes the elegant look of this mattress; backed by a 10-year warranty against manufacturer defects","Compressed, rolled, and shipped in a box for simple setup; easily fits through narrow hallways and staircases","100 NIGHT RISK-FREE TRIAL: IF YOU ARE UNSATISFIED WITH THIS MATTRESS, YOU ARE ELIGIBLE FOR A FULL REFUND UP TO 100 DAYS FROM DATE OF RECEIPT"]},{"title":"TUFT & NEEDLE - Original King Adaptive Foam Mattress, CertiPUR-US, 100-Night Trial","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41bFJMG8RKL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41bFJMG8RKL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41bFJMG8RKL._SL500_.jpg","Height":500,"Width":500}},"contents":["PROVEN - Over a million people choose us every night. In fact, 95% of our customers keep and love their T&N Original Mattress, featuring our own proprietary T&N Adaptive foam, the Original Mattress is universally comfortable for all sleeping positions","PROPRIETARY FOAM - Our T&N Adaptive foam is engineered based on customer feedback and provides pressure relief where you need it most. An open-cell structure provides a flexible sleep surface that adjusts to you as you move throughout the night","COOL SLEEPING - Our foam is more advanced than outdated materials such as latex and memory foam, the T&N Adaptive foam helps pull away heat with cooling graphite and gel beads, wrapped in our breathable plush cover to help keep you cool and comfortable","FREE OF HARMFUL CHEMICALS - Our mattresses are GREENGUARD Gold and CertiPUR-US certified, this means our beds are held to the highest of standards and are third party tested and certified to free of harmful chemicals, substances or materials","QUESTIONS? - We pride ourselves on customer service and urge you to reach out to us directly if you have any questions at any point, our expert customer service team will be available to help you through any hesitations, problems or questions you may have","NOTE - Please allow up to 72 hours for the mattress to fully expand and for any potential odor to dissipate"]},{"title":"ZINUS 10 Inch Green Tea Cooling Gel Memory Foam Mattress / Cooling Gel Foam / Pressure Relieving / CertiPUR-US Certified / Bed-in-a-Box, Full","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51WOOY4DxPL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51WOOY4DxPL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51WOOY4DxPL._SL500_.jpg","Height":500,"Width":500}},"contents":["AS COOL AS IT GETS - Settle in to a bed made with our most cooling formula yet, promising perfectly temperature-regulated sleep and a clean feeling night after night, all thanks to our enveloping memory foam packed with cooling gel and green tea","PRESSURE-RELIEVING FOAMS – Layers of ultra-cooling gel and green tea infused memory foam, soft comfort foam and durable, high density base foam","CERTIPUR US CERTIFIED - Highest quality foam is CertiPUR US Certified for durability, performance, and content","EXPERTLY PACKAGED - Our technology allows this mattress to be efficiently compressed into one box that’s easily shipped and maneuvered into the bedroom; simply unbox, unroll and this mattress does the rest, expanding to its original shape within 72 hours","Worry-free 10 year limited warranty included; twin mattress supports a maximum weight of 250 lbs, while all other sizes can support up to 500 lbs"]},{"title":"Amazon Basics Cooling Gel Infused Firm Support Latex-Feel Mattress, CertiPUR-US Certified - Queen Size, 12 inch","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41JhkjnN3xL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41JhkjnN3xL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41JhkjnN3xL._SL500_.jpg","Height":500,"Width":500}},"contents":["Three-layer hypoallergenic memory foam mattress with cooling gel-infused alternative-latex top layer, breathable support-foam middle layer and durable foam base","Queen-size mattress measures 80 x 60 x 12 inches (LxWxH)","Responsive LURAcor alternative-latex foam top layer offers more bouncy rebound and less “sink” compared to traditional memory foam","Firm-feel mattress helps keep spine in alignment and provide relief to shoulders, hips, and other pressure points; promotes a restful night's sleep for any body type and sleeping position (front, side, or back)","CertiPUR-US certified and made in the USA of domestic and imported parts; luxurious quilted cover for extra softness","Vacuum-packed for convenient shipping; allow up to 72 hours for mattress to reach full height"]},{"title":"Casper Sleep Original Hybrid Mattress, King","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51HSMOKzRqL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51HSMOKzRqL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51HSMOKzRqL._SL500_.jpg","Height":500,"Width":500}},"contents":["Zoned SupportTM: Three zones of targeted support for proper spinal alignment. Softer foam around the shoulders provides more relief to the upper body. Firmer foam under the hips, waist, and lower back helps align your spine.","AirScapeTM: A layer of AirScapeTM perforated breathable foam increases airflow and circulates air so you don't get too hot at night. The tiny holes move hot air and body heat away.","Base: Resilient springs add a little lift, support and airflow to the mattress of your dreams. A firmer border provides edge support to help you get in and out of bed easily.","Certified by our Sleep Lab","Dimensions: 76\" W x 80\" L x 11\" H | Weight: 112 lbs","All our polyurethane foams are CertiPUR-US certified. They are made without ozone-depleting chemicals and phthalates regulated by the Consumer Product Safety Commission. The foams have been tested for low VOC (Volatile Organic Compound) emissions for indoor air quality (less than 0.5 parts per million)"]},{"title":"Classic Brands Cool Gel Ventilated Memory Foam 12-Inch Mattress | CertiPUR-US Certified | Bed-in-a-Box, Twin XL","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51hK+F1stJL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51hK+F1stJL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51hK+F1stJL._SL500_.jpg","Height":500,"Width":500}},"contents":["39\" W x 80\" L x 12\" H","The latest in sleep technology, cool gel memory foam layer for temperature regulation with layers of ventilated egg crate foam for breathability layered on high-density base foam for maximum comfort and support","Beautifully detailed waterfall edge cover with four way stretch top and charcoal gray knit sides works with the memory foam to optimize its conforming properties","High-quality memory foam conforms to your body while the cool gel regulates body temperature; porous, open cell design allows for a greater circulation and meets CertiPUR-US program standards for performance, emissions, and durability","Medium-Plush Feel and Adjustable Base Friendly; 10 Year Warranty","Mattress ships compressed, rolled and shipped in a box conveniently delivered to your door for easy set-up; frame/foundation/base not included"]},{"title":"Sweetnight 12 Inch Queen Size Mattress in Box, Pillow Top Gel Memory Foam Mattress for Motion Isolation & Cool Sleep, Flippable Comfort from Soft to Medium Firm, Sunkiss","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51hvXLN11VL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51hvXLN11VL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51hvXLN11VL._SL500_.jpg","Height":500,"Width":500}},"contents":["FLIPPABLE QUEEN MATTRESS-Sweetnight queen size mattress is designed to be flappable with unique 4 layered foams. Allow you to sleep on either side. It’s like having 2 in 1. Great value for money. Gel infused memory foam on the Top keeps you cool, followed by comfort foam, pressure points & keep your body balanced. And the high-density support foam on the bottom for durability and performance, strengthens edge-to-edge support, resists sagging and roll-off.","3-ZONE EXCLUSIVE FOAM FOR RELAXING NIGHT OF SLEEP-The queen size mattress is designed with exclusive foam. 4 layers & 3 zones better adapt to the size, shape and weight of any body for the perfect level of support. Keeps your body properly aligned, relieves pressure at a comfortable, cooling sleep. This mattress queen size helps those with back pain & sweat with medium-firm feel.","GEL-INFUSED MEMORY FOAM FOR MOTION DISTURBANCE & BACK SUPPORT- Made with pillow top gel memory foam and high density foam, the queen memory foam mattress provides a full 12 inches of comfort and support. Cradle your body & relieve pressure in your shoulders, spine, hips & feet. The foam core also provides balanced support & eliminates motion disturbance. Talk about the best bedtime story with this queen foam mattress.","NO CONCERN SLEEP & 10 YEAR PROMISE- We as the maker, the fair price pillow top queen mattresses you can get. Sweetnight mattress made with CertiPUR-US Certified foam, which is free of unhealthy foam, ensuring a no concern sleep. Our queen size mattresses come with 10 years . Over 96% of our customers keep their gel memory foam mattress and refer it to others. They fit all frames, such as box spring, floor, slatted base, flat platform.","SMARTLY SHIPPED & MATTRESS IN A BOX- Our mattresses queen size are compressed, rolled & shipped in a box conveniently to your door for easy set up. Easy to move through narrow hallways and staircases. Recovery of 72 hours is recommended for your new mattress to get to its original and plush shape. We recommend sleeping on gel mattress for a few weeks in order to give your mattress a chance to“break-in” to the way you sleep."]},{"title":"Amazon Brand – Rivet Mattress - Supportive Pressure Relief Memory Foam with Celliant Cover for Restorative Sleep, 10-Inch Height, Queen","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41pDjULUMtL._SL75_.jpg","Height":46,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41pDjULUMtL._SL160_.jpg","Height":99,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41pDjULUMtL._SL500_.jpg","Height":311,"Width":500}},"contents":["Queen mattress measures 80\"L x 60\"W x 10\"H","Experience deep, restorative sleep with the Rivet Mattress. Our 3-layer design with Celliant technology is instantly responsive so you fall asleep faster, stay asleep longer, and recover more deeply","LURAcor top layer provides instantly responsive support to lift and align your spine throughout the night and relieve pressure points like the back and hips","Memory foam middle layer evenly distributes weight and provides custom support","Our cover fabric features Celliant, a patented mineral blend proven to increase oxygen delivery to your cells for better overnight recovery and more all-day energy","Made in the USA of U.S. and imported parts. Our premium foam is USA-made, certified by CertiPUR US, and backed by a 10-year warranty for quality, safety, and durability you can trust","Mattresses arrive compressed for convenient shipment; allow 48-72 hours to fully expand. Other factors, like cold weather, can affect decompression times"]},{"title":"Pure Green Organic Latex Mattress - Medium Firmness - Full","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51aHYq4E2gL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51aHYq4E2gL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51aHYq4E2gL._SL500_.jpg","Height":500,"Width":500}},"contents":["Medium Firmness - Great for Side Sleepers, Back Sleepers and Couples","Filled with 8” Organic Latex Foam (GOLS Certified) - Quilted Cover Made of Organic Cotton and Organic Wool","Designed, Quilted, Sewn, Assembled and Packaged in our Chicago Factory","GOTS Certified Organic - GOLS Certified Organic - Fair For Life Fair Trade Certified - Oeko-Tex Standard 100 Certified","No Assembly Required - Roll Compressed & Wrapped in Paper (not Plastic) - Unroll the Paper Wrap, and your Mattress Will Spring to Life!"]},{"title":"Pure Green Organic Latex Mattress - Firm - Full","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/51aHYq4E2gL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/51aHYq4E2gL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/51aHYq4E2gL._SL500_.jpg","Height":500,"Width":500}},"contents":["Firm - Very Supportive and Strong with Just Enough Give to Help Alleviate Pressure Points","Filled with 8” Organic Latex Foam (GOLS Certified) - Quilted Cover Made of Organic Cotton and Organic Wool","Designed, Quilted, Sewn, Assembled and Packaged in our Chicago Factory","GOTS Certified Organic - GOLS Certified Organic - Fair For Life Fair Trade Certified - Oeko-Tex Standard 100 Certified","No Assembly Required - Roll Compressed & Wrapped in Paper (not Plastic) - Unroll the Paper Wrap, and your Mattress Will Spring to Life!"]},{"title":"GhostBed Classic 11 Inch Cool Gel Memory Foam & Latex Mattress - Medium-Firm Feel, Made in The USA, Queen","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41mC4SPYPIL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41mC4SPYPIL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41mC4SPYPIL._SL500_.jpg","Height":500,"Width":500}},"contents":["4 LAYERS OF COMFORT - Crafted from high-quality cooling gel memory foam, high-density support foam and aerated latex, the 11” GhostBed Classic merges luxury and durability to help you get amazing sleep","WAKE UP FEELING REFRESHED - High-density foam core supports spinal alignment, alleviates hip and back pain, and relieves stiffness; it’s soft, supportive and springy - but with minimal motion transfer","PERFECT FOR ALL SLEEPERS - With its balanced, medium-firm feel, the GhostBed Classic is a great option for sleepers of all types: stomach, back, side and combo","CERTI-PUR US CERTIFIED - Sleep soundly knowing you’re snoozing on CertiPUR-US certified materials","MADE IN THE USA - All GhostBed mattresses, including the GhostBed Classic, are made in the USA with the highest quality materials"]},{"title":"ZINUS 14 Inch Green Tea Cooling Swirl Memory Foam Hybrid Mattress / Pocket Innersprings for Motion Isolation / Edge Support, King","images":{"Small":{"URL":"https://m.media-amazon.com/images/I/41DyGGWtZKL._SL75_.jpg","Height":75,"Width":75},"Medium":{"URL":"https://m.media-amazon.com/images/I/41DyGGWtZKL._SL160_.jpg","Height":160,"Width":160},"Large":{"URL":"https://m.media-amazon.com/images/I/41DyGGWtZKL._SL500_.jpg","Height":500,"Width":500}},"contents":["COOL, CALM & COMFY - This mattress delivers the 3 C’s of sleep, even if your partner likes to practice their dance moves in bed; our cooling swirl memory foam and independent coil system eliminate excess heat and motion from a sleeping partner, for sleep that’s no sweat","CONFORMING FOAM & POCKET SPRINGS – Layers of soft comfort foam, cooling swirl memory foam, supportive fusion foam and motion-isolating independent pocket springs provide customized pressure relief and rest that’s cool and undisturbed","CERTIPUR US CERTIFIED - Highest quality foam is CertiPUR US Certified for durability, performance, and content","EXPERTLY PACKAGED - Our technology allows this mattress to be efficiently compressed into one box that’s easily shipped and maneuvered into the bedroom; simply unbox, unroll and this mattress does the rest, expanding to its original shape within 72 hours","Worry-free 10 year limited warranty included; twin mattress supports a maximum weight of 250 lbs, while all other sizes can support up to 500 lbs"]}]},"body":null,"slug":"latex-mattresse","batch":{"id":2,"keywords":"lace front wig,\nlaminator,\nlandline phone,\nlap desk,\nlaptop backpack,\nlaptop cooling pad,\nlaptop,\nlaser printer,\nlaser rangefinder,\nlaser sight,\nlatex mattresse,\nlawn edger,\nlawn fertilizer,\nlawn sprinkler,\nlawn sweeper,\nmagnetic tape,\nmagnifying glasse,\nmandoline slicer,\nmandolin slicer,\nmanual food chopper,\nmargarita machine,\nmassage cushion,\nmassage oil,\nmassage table,\nmasticating juicer,\nmattresse,\nmattress pad,\ncomputer monitors,\nPortable HDD,\nlabel maker","category":null,"created_at":"2022-03-15T17:23:45.322Z","updated_at":"2022-03-15T17:23:45.322Z"},"published_at":"2022-03-15T17:27:27.777Z","created_at":"2022-03-15T17:27:27.779Z","updated_at":"2022-03-15T17:27:27.804Z","SEO":null,"categories":[{"id":7,"name":"Furniture","description":null,"department":3,"slug":"furniture","published_at":"2022-03-15T17:27:27.726Z","created_at":"2022-03-15T17:27:27.727Z","updated_at":"2022-03-15T17:27:27.743Z"}]}},"__N_SSG":true}